
hello.elf:     file format elf32-ft32
hello.elf
architecture: ft32, flags 0x00000112:
EXEC_P, HAS_SYMS, D_PAGED
start address 0x00000000

Program Header:
    LOAD off    0x00000094 vaddr 0x00000000 paddr 0x00000000 align 2**0
         filesz 0x00004554 memsz 0x00004554 flags r-x
    LOAD off    0x000045e8 vaddr 0x00800000 paddr 0x00004554 align 2**0
         filesz 0x00000850 memsz 0x00000850 flags rw-
    LOAD off    0x00000000 vaddr 0x00800850 paddr 0x00800850 align 2**0
         filesz 0x00000000 memsz 0x00000044 flags rw-

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .data         00000850  00800000  00004554  000045e8  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  1 .bss          00000044  00800850  00800850  00004e38  2**2
                  ALLOC
  2 .text         00004554  00000000  00000000  00000094  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  3 .debug_line   00006ca2  00000000  00000000  00004e38  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  4 .debug_info   0000f793  00000000  00000000  0000bada  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  5 .debug_abbrev 000035c3  00000000  00000000  0001b26d  2**0
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  6 .debug_aranges 00000498  00000000  00000000  0001e830  2**3
                  CONTENTS, READONLY, DEBUGGING, OCTETS
  7 .debug_str    000013c5  00000000  00000000  0001ecc8  2**0

 <1><9f>: Abbrev Number: 4 (DW_TAG_subprogram)
    <a0>   DW_AT_external    : 1
    <a0>   DW_AT_name        : (indirect string, offset: 0x61): main
    <a4>   DW_AT_decl_file   : 1
    <a5>   DW_AT_decl_line   : 3
    <a6>   DW_AT_decl_column : 5
    <a7>   DW_AT_type        : <0x83>
    <ab>   DW_AT_low_pc      : 0x58
    <af>   DW_AT_high_pc     : 0x18
    <b3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b5>   DW_AT_GNU_all_tail_call_sites: 1
 <1><b5>: Abbrev Number: 0
  Compilation Unit @ offset 0xb6:
   Length:        0xa4d (32-bit)
   Version:       4
   Abbrev Offset: 0x58
   Pointer Size:  4
 <0><c1>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c2>   DW_AT_producer    : (indirect string, offset: 0x4c3): GNU C17 10.2.0 -g -O0 -fno-builtin
    <c6>   DW_AT_language    : 12	(ANSI C99)
    <c7>   DW_AT_name        : (indirect string, offset: 0x144): ../../../.././newlib/libc/stdio/puts.c
    <cb>   DW_AT_comp_dir    : (indirect string, offset: 0x2b1): /media/ca850f52-0605-42a7-9fd4-899de9edf461/work/GNU_LANG/newlib-4.1.0.ft32-elf/ft32-elf/newlib/libc/stdio
    <cf>   DW_AT_low_pc      : 0x70
    <d3>   DW_AT_high_pc     : 0x154
    <d7>   DW_AT_stmt_list   : 0xa5
 <1><db>: Abbrev Number: 2 (DW_TAG_base_type)
    <dc>   DW_AT_byte_size   : 4
    <dd>   DW_AT_encoding    : 5	(signed)
    <de>   DW_AT_name        : int
 <1><e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <e3>   DW_AT_name        : (indirect string, offset: 0x105e): size_t
    <e7>   DW_AT_decl_file   : 2
    <e8>   DW_AT_decl_line   : 209
    <e9>   DW_AT_decl_column : 23
    <ea>   DW_AT_type        : <0xee>
 <1><ee>: Abbrev Number: 4 (DW_TAG_base_type)
    <ef>   DW_AT_byte_size   : 4
    <f0>   DW_AT_encoding    : 7	(unsigned)
    <f1>   DW_AT_name        : (indirect string, offset: 0x70): unsigned int
 <1><f5>: Abbrev Number: 4 (DW_TAG_base_type)
    <f6>   DW_AT_byte_size   : 4
    <f7>   DW_AT_encoding    : 5	(signed)
    <f8>   DW_AT_name        : (indirect string, offset: 0x58): long int
 <1><fc>: Abbrev Number: 4 (DW_TAG_base_type)
    <fd>   DW_AT_byte_size   : 8
    <fe>   DW_AT_encoding    : 5	(signed)
    <ff>   DW_AT_name        : (indirect string, offset: 0x53): long long int
 <1><103>: Abbrev Number: 4 (DW_TAG_base_type)
    <104>   DW_AT_byte_size   : 8
    <105>   DW_AT_encoding    : 4	(float)
    <106>   DW_AT_name        : (indirect string, offset: 0xb0): long double
 <1><10a>: Abbrev Number: 5 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0x31c): wint_t
    <10f>   DW_AT_decl_file   : 2
    <110>   DW_AT_decl_line   : 350
    <112>   DW_AT_decl_column : 23
    <113>   DW_AT_type        : <0xee>
 <1><117>: Abbrev Number: 4 (DW_TAG_base_type)
    <118>   DW_AT_byte_size   : 1
    <119>   DW_AT_encoding    : 6	(signed char)
    <11a>   DW_AT_name        : (indirect string, offset: 0x91): signed char
 <1><11e>: Abbrev Number: 4 (DW_TAG_base_type)
    <11f>   DW_AT_byte_size   : 1
    <120>   DW_AT_encoding    : 8	(unsigned char)
    <121>   DW_AT_name        : (indirect string, offset: 0x8f): unsigned char
 <1><125>: Abbrev Number: 4 (DW_TAG_base_type)
    <126>   DW_AT_byte_size   : 2
    <127>   DW_AT_encoding    : 5	(signed)
    <128>   DW_AT_name        : (indirect string, offset: 0xbc): short int
 <1><12c>: Abbrev Number: 4 (DW_TAG_base_type)
    <12d>   DW_AT_byte_size   : 2
    <12e>   DW_AT_encoding    : 7	(unsigned)
    <12f>   DW_AT_name        : (indirect string, offset: 0x9d): short unsigned int
 <1><133>: Abbrev Number: 4 (DW_TAG_base_type)
    <134>   DW_AT_byte_size   : 4
    <135>   DW_AT_encoding    : 7	(unsigned)
    <136>   DW_AT_name        : (indirect string, offset: 0x6b): long unsigned int
 <1><13a>: Abbrev Number: 4 (DW_TAG_base_type)
    <13b>   DW_AT_byte_size   : 8
    <13c>   DW_AT_encoding    : 7	(unsigned)
    <13d>   DW_AT_name        : (indirect string, offset: 0x66): long long unsigned int
 <1><141>: Abbrev Number: 3 (DW_TAG_typedef)
    <142>   DW_AT_name        : (indirect string, offset: 0xf68): _off_t
    <146>   DW_AT_decl_file   : 3
    <147>   DW_AT_decl_line   : 46
    <148>   DW_AT_decl_column : 14
    <149>   DW_AT_type        : <0xf5>
 <1><14d>: Abbrev Number: 3 (DW_TAG_typedef)
    <14e>   DW_AT_name        : (indirect string, offset: 0x460): _fpos_t
    <152>   DW_AT_decl_file   : 3
    <153>   DW_AT_decl_line   : 116
    <154>   DW_AT_decl_column : 14
    <155>   DW_AT_type        : <0xf5>
 <1><159>: Abbrev Number: 6 (DW_TAG_union_type)
    <15a>   DW_AT_byte_size   : 4
    <15b>   DW_AT_decl_file   : 3
    <15c>   DW_AT_decl_line   : 165
    <15d>   DW_AT_decl_column : 3
    <15e>   DW_AT_sibling     : <0x17b>
 <2><162>: Abbrev Number: 7 (DW_TAG_member)
    <163>   DW_AT_name        : (indirect string, offset: 0x2ab): __wch
    <167>   DW_AT_decl_file   : 3
    <168>   DW_AT_decl_line   : 167
    <169>   DW_AT_decl_column : 12
    <16a>   DW_AT_type        : <0x10a>
 <2><16e>: Abbrev Number: 7 (DW_TAG_member)
    <16f>   DW_AT_name        : (indirect string, offset: 0x263): __wchb
    <173>   DW_AT_decl_file   : 3
    <174>   DW_AT_decl_line   : 168
    <175>   DW_AT_decl_column : 19
    <176>   DW_AT_type        : <0x17b>
 <2><17a>: Abbrev Number: 0
 <1><17b>: Abbrev Number: 8 (DW_TAG_array_type)
    <17c>   DW_AT_type        : <0x11e>
    <180>   DW_AT_sibling     : <0x18b>
 <2><184>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <185>   DW_AT_type        : <0xee>
    <189>   DW_AT_upper_bound : 3
 <2><18a>: Abbrev Number: 0
 <1><18b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <18c>   DW_AT_byte_size   : 8
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 162
    <18f>   DW_AT_decl_column : 9
    <190>   DW_AT_sibling     : <0x1af>
 <2><194>: Abbrev Number: 11 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x44a): __count
    <199>   DW_AT_decl_file   : 3
    <19a>   DW_AT_decl_line   : 164
    <19b>   DW_AT_decl_column : 7
    <19c>   DW_AT_type        : <0xdb>
    <1a0>   DW_AT_data_member_location: 0
 <2><1a1>: Abbrev Number: 11 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x452): __value
    <1a6>   DW_AT_decl_file   : 3
    <1a7>   DW_AT_decl_line   : 169
    <1a8>   DW_AT_decl_column : 5
    <1a9>   DW_AT_type        : <0x159>
    <1ad>   DW_AT_data_member_location: 4
 <2><1ae>: Abbrev Number: 0
 <1><1af>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x3d3): _mbstate_t
    <1b4>   DW_AT_decl_file   : 3
    <1b5>   DW_AT_decl_line   : 170
    <1b6>   DW_AT_decl_column : 3
    <1b7>   DW_AT_type        : <0x18b>
 <1><1bb>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1bc>   DW_AT_byte_size   : 4
 <1><1bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <1be>   DW_AT_name        : (indirect string, offset: 0x492): __ULong
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 22
    <1c4>   DW_AT_decl_column : 25
    <1c5>   DW_AT_type        : <0x133>
 <1><1c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x37f): _LOCK_RECURSIVE_T
    <1ce>   DW_AT_decl_file   : 5
    <1cf>   DW_AT_decl_line   : 12
    <1d0>   DW_AT_decl_column : 13
    <1d1>   DW_AT_type        : <0xdb>
 <1><1d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x226): _flock_t
    <1da>   DW_AT_decl_file   : 4
    <1db>   DW_AT_decl_line   : 35
    <1dc>   DW_AT_decl_column : 27
    <1dd>   DW_AT_type        : <0x1c9>
 <1><1e1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x237): _Bigint
    <1e6>   DW_AT_byte_size   : 24
    <1e7>   DW_AT_decl_file   : 4
    <1e8>   DW_AT_decl_line   : 52
    <1e9>   DW_AT_decl_column : 8
    <1ea>   DW_AT_sibling     : <0x23b>
 <2><1ee>: Abbrev Number: 11 (DW_TAG_member)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x3f4): _next
    <1f3>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 54
    <1f5>   DW_AT_decl_column : 19
    <1f6>   DW_AT_type        : <0x23b>
    <1fa>   DW_AT_data_member_location: 0
 <2><1fb>: Abbrev Number: 14 (DW_TAG_member)
    <1fc>   DW_AT_name        : _k
    <1ff>   DW_AT_decl_file   : 4
    <200>   DW_AT_decl_line   : 55
    <201>   DW_AT_decl_column : 7
    <202>   DW_AT_type        : <0xdb>
    <206>   DW_AT_data_member_location: 4
 <2><207>: Abbrev Number: 11 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x43c): _maxwds
    <20c>   DW_AT_decl_file   : 4
    <20d>   DW_AT_decl_line   : 55
    <20e>   DW_AT_decl_column : 11
    <20f>   DW_AT_type        : <0xdb>
    <213>   DW_AT_data_member_location: 8
 <2><214>: Abbrev Number: 11 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x220): _sign
    <219>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 55
    <21b>   DW_AT_decl_column : 20
    <21c>   DW_AT_type        : <0xdb>
    <220>   DW_AT_data_member_location: 12
 <2><221>: Abbrev Number: 11 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x4b4): _wds
    <226>   DW_AT_decl_file   : 4
    <227>   DW_AT_decl_line   : 55
    <228>   DW_AT_decl_column : 27
    <229>   DW_AT_type        : <0xdb>
    <22d>   DW_AT_data_member_location: 16
 <2><22e>: Abbrev Number: 14 (DW_TAG_member)
    <22f>   DW_AT_name        : _x
    <232>   DW_AT_decl_file   : 4
    <233>   DW_AT_decl_line   : 56
    <234>   DW_AT_decl_column : 11
    <235>   DW_AT_type        : <0x241>
    <239>   DW_AT_data_member_location: 20
 <2><23a>: Abbrev Number: 0
 <1><23b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <23c>   DW_AT_byte_size   : 4
    <23d>   DW_AT_type        : <0x1e1>
 <1><241>: Abbrev Number: 8 (DW_TAG_array_type)
    <242>   DW_AT_type        : <0x1bd>
    <246>   DW_AT_sibling     : <0x251>
 <2><24a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <24b>   DW_AT_type        : <0xee>
    <24f>   DW_AT_upper_bound : 0
 <2><250>: Abbrev Number: 0
 <1><251>: Abbrev Number: 13 (DW_TAG_structure_type)
    <252>   DW_AT_name        : (indirect string, offset: 0x25e): __tm
    <256>   DW_AT_byte_size   : 36
    <257>   DW_AT_decl_file   : 4
    <258>   DW_AT_decl_line   : 60
    <259>   DW_AT_decl_column : 8
    <25a>   DW_AT_sibling     : <0x2d4>
 <2><25e>: Abbrev Number: 11 (DW_TAG_member)
    <25f>   DW_AT_name        : (indirect string, offset: 0x188): __tm_sec
    <263>   DW_AT_decl_file   : 4
    <264>   DW_AT_decl_line   : 62
    <265>   DW_AT_decl_column : 9
    <266>   DW_AT_type        : <0xdb>
    <26a>   DW_AT_data_member_location: 0
 <2><26b>: Abbrev Number: 11 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0x468): __tm_min
    <270>   DW_AT_decl_file   : 4
    <271>   DW_AT_decl_line   : 63
    <272>   DW_AT_decl_column : 9
    <273>   DW_AT_type        : <0xdb>
    <277>   DW_AT_data_member_location: 4
 <2><278>: Abbrev Number: 11 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x197): __tm_hour
    <27d>   DW_AT_decl_file   : 4
    <27e>   DW_AT_decl_line   : 64
    <27f>   DW_AT_decl_column : 9
    <280>   DW_AT_type        : <0xdb>
    <284>   DW_AT_data_member_location: 8
 <2><285>: Abbrev Number: 11 (DW_TAG_member)
    <286>   DW_AT_name        : (indirect string, offset: 0x54a): __tm_mday
    <28a>   DW_AT_decl_file   : 4
    <28b>   DW_AT_decl_line   : 65
    <28c>   DW_AT_decl_column : 9
    <28d>   DW_AT_type        : <0xdb>
    <291>   DW_AT_data_member_location: 12
 <2><292>: Abbrev Number: 11 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x359): __tm_mon
    <297>   DW_AT_decl_file   : 4
    <298>   DW_AT_decl_line   : 66
    <299>   DW_AT_decl_column : 9
    <29a>   DW_AT_type        : <0xdb>
    <29e>   DW_AT_data_member_location: 16
 <2><29f>: Abbrev Number: 11 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x343): __tm_year
    <2a4>   DW_AT_decl_file   : 4
    <2a5>   DW_AT_decl_line   : 67
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_type        : <0xdb>
    <2ab>   DW_AT_data_member_location: 20
 <2><2ac>: Abbrev Number: 11 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x4b9): __tm_wday
    <2b1>   DW_AT_decl_file   : 4
    <2b2>   DW_AT_decl_line   : 68
    <2b3>   DW_AT_decl_column : 9
    <2b4>   DW_AT_type        : <0xdb>
    <2b8>   DW_AT_data_member_location: 24
 <2><2b9>: Abbrev Number: 11 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x3b5): __tm_yday
    <2be>   DW_AT_decl_file   : 4
    <2bf>   DW_AT_decl_line   : 69
    <2c0>   DW_AT_decl_column : 9
    <2c1>   DW_AT_type        : <0xdb>
    <2c5>   DW_AT_data_member_location: 28
 <2><2c6>: Abbrev Number: 11 (DW_TAG_member)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x511): __tm_isdst
    <2cb>   DW_AT_decl_file   : 4
    <2cc>   DW_AT_decl_line   : 70
    <2cd>   DW_AT_decl_column : 9
    <2ce>   DW_AT_type        : <0xdb>
    <2d2>   DW_AT_data_member_location: 32
 <2><2d3>: Abbrev Number: 0
 <1><2d4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x1a6): _on_exit_args
    <2d9>   DW_AT_byte_size   : 264
    <2db>   DW_AT_decl_file   : 4
    <2dc>   DW_AT_decl_line   : 79
    <2dd>   DW_AT_decl_column : 8
    <2de>   DW_AT_sibling     : <0x319>
 <2><2e2>: Abbrev Number: 11 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x213): _fnargs
    <2e7>   DW_AT_decl_file   : 4
    <2e8>   DW_AT_decl_line   : 80
    <2e9>   DW_AT_decl_column : 10
    <2ea>   DW_AT_type        : <0x319>
    <2ee>   DW_AT_data_member_location: 0
 <2><2ef>: Abbrev Number: 11 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xce): _dso_handle
    <2f4>   DW_AT_decl_file   : 4
    <2f5>   DW_AT_decl_line   : 81
    <2f6>   DW_AT_decl_column : 9
    <2f7>   DW_AT_type        : <0x319>
    <2fb>   DW_AT_data_member_location: 128
 <2><2fc>: Abbrev Number: 17 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x484): _fntypes
    <301>   DW_AT_decl_file   : 4
    <302>   DW_AT_decl_line   : 83
    <303>   DW_AT_decl_column : 10
    <304>   DW_AT_type        : <0x1bd>
    <308>   DW_AT_data_member_location: 256
 <2><30a>: Abbrev Number: 17 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x1d5): _is_cxa
    <30f>   DW_AT_decl_file   : 4
    <310>   DW_AT_decl_line   : 86
    <311>   DW_AT_decl_column : 10
    <312>   DW_AT_type        : <0x1bd>
    <316>   DW_AT_data_member_location: 260
 <2><318>: Abbrev Number: 0
 <1><319>: Abbrev Number: 8 (DW_TAG_array_type)
    <31a>   DW_AT_type        : <0x1bb>
    <31e>   DW_AT_sibling     : <0x329>
 <2><322>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <323>   DW_AT_type        : <0xee>
    <327>   DW_AT_upper_bound : 31
 <2><328>: Abbrev Number: 0
 <1><329>: Abbrev Number: 16 (DW_TAG_structure_type)
    <32a>   DW_AT_name        : (indirect string, offset: 0x362): _atexit
    <32e>   DW_AT_byte_size   : 400
    <330>   DW_AT_decl_file   : 4
    <331>   DW_AT_decl_line   : 98
    <332>   DW_AT_decl_column : 8
    <333>   DW_AT_sibling     : <0x36c>
 <2><337>: Abbrev Number: 11 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0x3f4): _next
    <33c>   DW_AT_decl_file   : 4
    <33d>   DW_AT_decl_line   : 99
    <33e>   DW_AT_decl_column : 18
    <33f>   DW_AT_type        : <0x36c>
    <343>   DW_AT_data_member_location: 0
 <2><344>: Abbrev Number: 11 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0x40c): _ind
    <349>   DW_AT_decl_file   : 4
    <34a>   DW_AT_decl_line   : 100
    <34b>   DW_AT_decl_column : 6
    <34c>   DW_AT_type        : <0xdb>
    <350>   DW_AT_data_member_location: 4
 <2><351>: Abbrev Number: 11 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0x21b): _fns
    <356>   DW_AT_decl_file   : 4
    <357>   DW_AT_decl_line   : 102
    <358>   DW_AT_decl_column : 9
    <359>   DW_AT_type        : <0x372>
    <35d>   DW_AT_data_member_location: 8
 <2><35e>: Abbrev Number: 11 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x1a6): _on_exit_args
    <363>   DW_AT_decl_file   : 4
    <364>   DW_AT_decl_line   : 103
    <365>   DW_AT_decl_column : 30
    <366>   DW_AT_type        : <0x2d4>
    <36a>   DW_AT_data_member_location: 136
 <2><36b>: Abbrev Number: 0
 <1><36c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <36d>   DW_AT_byte_size   : 4
    <36e>   DW_AT_type        : <0x329>
 <1><372>: Abbrev Number: 8 (DW_TAG_array_type)
    <373>   DW_AT_type        : <0x382>
    <377>   DW_AT_sibling     : <0x382>
 <2><37b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <37c>   DW_AT_type        : <0xee>
    <380>   DW_AT_upper_bound : 31
 <2><381>: Abbrev Number: 0
 <1><382>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <383>   DW_AT_byte_size   : 4
    <384>   DW_AT_type        : <0x388>
 <1><388>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <389>   DW_AT_prototyped  : 1
 <1><389>: Abbrev Number: 13 (DW_TAG_structure_type)
    <38a>   DW_AT_name        : (indirect string, offset: 0x3bf): __sbuf
    <38e>   DW_AT_byte_size   : 8
    <38f>   DW_AT_decl_file   : 4
    <390>   DW_AT_decl_line   : 122
    <391>   DW_AT_decl_column : 8
    <392>   DW_AT_sibling     : <0x3b1>
 <2><396>: Abbrev Number: 11 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0xb56): _base
    <39b>   DW_AT_decl_file   : 4
    <39c>   DW_AT_decl_line   : 123
    <39d>   DW_AT_decl_column : 17
    <39e>   DW_AT_type        : <0x3b1>
    <3a2>   DW_AT_data_member_location: 0
 <2><3a3>: Abbrev Number: 11 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0xa4c): _size
    <3a8>   DW_AT_decl_file   : 4
    <3a9>   DW_AT_decl_line   : 124
    <3aa>   DW_AT_decl_column : 6
    <3ab>   DW_AT_type        : <0xdb>
    <3af>   DW_AT_data_member_location: 4
 <2><3b0>: Abbrev Number: 0
 <1><3b1>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3b2>   DW_AT_byte_size   : 4
    <3b3>   DW_AT_type        : <0x11e>
 <1><3b7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x3de): __sFILE
    <3bc>   DW_AT_byte_size   : 104
    <3bd>   DW_AT_decl_file   : 4
    <3be>   DW_AT_decl_line   : 186
    <3bf>   DW_AT_decl_column : 8
    <3c0>   DW_AT_sibling     : <0x4fa>
 <2><3c4>: Abbrev Number: 14 (DW_TAG_member)
    <3c5>   DW_AT_name        : _p
    <3c8>   DW_AT_decl_file   : 4
    <3c9>   DW_AT_decl_line   : 187
    <3ca>   DW_AT_decl_column : 18
    <3cb>   DW_AT_type        : <0x3b1>
    <3cf>   DW_AT_data_member_location: 0
 <2><3d0>: Abbrev Number: 14 (DW_TAG_member)
    <3d1>   DW_AT_name        : _r
    <3d4>   DW_AT_decl_file   : 4
    <3d5>   DW_AT_decl_line   : 188
    <3d6>   DW_AT_decl_column : 7
    <3d7>   DW_AT_type        : <0xdb>
    <3db>   DW_AT_data_member_location: 4
 <2><3dc>: Abbrev Number: 14 (DW_TAG_member)
    <3dd>   DW_AT_name        : _w
    <3e0>   DW_AT_decl_file   : 4
    <3e1>   DW_AT_decl_line   : 189
    <3e2>   DW_AT_decl_column : 7
    <3e3>   DW_AT_type        : <0xdb>
    <3e7>   DW_AT_data_member_location: 8
 <2><3e8>: Abbrev Number: 11 (DW_TAG_member)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x1ce): _flags
    <3ed>   DW_AT_decl_file   : 4
    <3ee>   DW_AT_decl_line   : 190
    <3ef>   DW_AT_decl_column : 9
    <3f0>   DW_AT_type        : <0x125>
    <3f4>   DW_AT_data_member_location: 12
 <2><3f5>: Abbrev Number: 11 (DW_TAG_member)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x719): _file
    <3fa>   DW_AT_decl_file   : 4
    <3fb>   DW_AT_decl_line   : 191
    <3fc>   DW_AT_decl_column : 9
    <3fd>   DW_AT_type        : <0x125>
    <401>   DW_AT_data_member_location: 14
 <2><402>: Abbrev Number: 14 (DW_TAG_member)
    <403>   DW_AT_name        : _bf
    <407>   DW_AT_decl_file   : 4
    <408>   DW_AT_decl_line   : 192
    <409>   DW_AT_decl_column : 17
    <40a>   DW_AT_type        : <0x389>
    <40e>   DW_AT_data_member_location: 16
 <2><40f>: Abbrev Number: 11 (DW_TAG_member)
    <410>   DW_AT_name        : (indirect string, offset: 0x130): _lbfsize
    <414>   DW_AT_decl_file   : 4
    <415>   DW_AT_decl_line   : 193
    <416>   DW_AT_decl_column : 7
    <417>   DW_AT_type        : <0xdb>
    <41b>   DW_AT_data_member_location: 24
 <2><41c>: Abbrev Number: 11 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x1b4): _cookie
    <421>   DW_AT_decl_file   : 4
    <422>   DW_AT_decl_line   : 200
    <423>   DW_AT_decl_column : 10
    <424>   DW_AT_type        : <0x1bb>
    <428>   DW_AT_data_member_location: 28
 <2><429>: Abbrev Number: 11 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x24e): _read
    <42e>   DW_AT_decl_file   : 4
    <42f>   DW_AT_decl_line   : 202
    <430>   DW_AT_decl_column : 29
    <431>   DW_AT_type        : <0x679>
    <435>   DW_AT_data_member_location: 32
 <2><436>: Abbrev Number: 11 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x33c): _write
    <43b>   DW_AT_decl_file   : 4
    <43c>   DW_AT_decl_line   : 204
    <43d>   DW_AT_decl_column : 29
    <43e>   DW_AT_type        : <0x6a3>
    <442>   DW_AT_data_member_location: 36
 <2><443>: Abbrev Number: 11 (DW_TAG_member)
    <444>   DW_AT_name        : (indirect string, offset: 0x45a): _seek
    <448>   DW_AT_decl_file   : 4
    <449>   DW_AT_decl_line   : 207
    <44a>   DW_AT_decl_column : 13
    <44b>   DW_AT_type        : <0x6c7>
    <44f>   DW_AT_data_member_location: 40
 <2><450>: Abbrev Number: 11 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0x52b): _close
    <455>   DW_AT_decl_file   : 4
    <456>   DW_AT_decl_line   : 208
    <457>   DW_AT_decl_column : 9
    <458>   DW_AT_type        : <0x6e1>
    <45c>   DW_AT_data_member_location: 44
 <2><45d>: Abbrev Number: 14 (DW_TAG_member)
    <45e>   DW_AT_name        : _ub
    <462>   DW_AT_decl_file   : 4
    <463>   DW_AT_decl_line   : 211
    <464>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0x389>
    <469>   DW_AT_data_member_location: 48
 <2><46a>: Abbrev Number: 14 (DW_TAG_member)
    <46b>   DW_AT_name        : _up
    <46f>   DW_AT_decl_file   : 4
    <470>   DW_AT_decl_line   : 212
    <471>   DW_AT_decl_column : 18
    <472>   DW_AT_type        : <0x3b1>
    <476>   DW_AT_data_member_location: 56
 <2><477>: Abbrev Number: 14 (DW_TAG_member)
    <478>   DW_AT_name        : _ur
    <47c>   DW_AT_decl_file   : 4
    <47d>   DW_AT_decl_line   : 213
    <47e>   DW_AT_decl_column : 7
    <47f>   DW_AT_type        : <0xdb>
    <483>   DW_AT_data_member_location: 60
 <2><484>: Abbrev Number: 11 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x191): _ubuf
    <489>   DW_AT_decl_file   : 4
    <48a>   DW_AT_decl_line   : 216
    <48b>   DW_AT_decl_column : 17
    <48c>   DW_AT_type        : <0x6e7>
    <490>   DW_AT_data_member_location: 64
 <2><491>: Abbrev Number: 11 (DW_TAG_member)
    <492>   DW_AT_name        : (indirect string, offset: 0x503): _nbuf
    <496>   DW_AT_decl_file   : 4
    <497>   DW_AT_decl_line   : 217
    <498>   DW_AT_decl_column : 17
    <499>   DW_AT_type        : <0x6f7>
    <49d>   DW_AT_data_member_location: 67
 <2><49e>: Abbrev Number: 14 (DW_TAG_member)
    <49f>   DW_AT_name        : _lb
    <4a3>   DW_AT_decl_file   : 4
    <4a4>   DW_AT_decl_line   : 220
    <4a5>   DW_AT_decl_column : 17
    <4a6>   DW_AT_type        : <0x389>
    <4aa>   DW_AT_data_member_location: 68
 <2><4ab>: Abbrev Number: 11 (DW_TAG_member)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x107e): _blksize
    <4b0>   DW_AT_decl_file   : 4
    <4b1>   DW_AT_decl_line   : 223
    <4b2>   DW_AT_decl_column : 7
    <4b3>   DW_AT_type        : <0xdb>
    <4b7>   DW_AT_data_member_location: 76
 <2><4b8>: Abbrev Number: 11 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x1ec): _offset
    <4bd>   DW_AT_decl_file   : 4
    <4be>   DW_AT_decl_line   : 224
    <4bf>   DW_AT_decl_column : 10
    <4c0>   DW_AT_type        : <0x141>
    <4c4>   DW_AT_data_member_location: 80
 <2><4c5>: Abbrev Number: 11 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x871): _data
    <4ca>   DW_AT_decl_file   : 4
    <4cb>   DW_AT_decl_line   : 227
    <4cc>   DW_AT_decl_column : 18
    <4cd>   DW_AT_type        : <0x518>
    <4d1>   DW_AT_data_member_location: 84
 <2><4d2>: Abbrev Number: 11 (DW_TAG_member)
    <4d3>   DW_AT_name        : (indirect string, offset: 0xc82): _lock
    <4d7>   DW_AT_decl_file   : 4
    <4d8>   DW_AT_decl_line   : 231
    <4d9>   DW_AT_decl_column : 12
    <4da>   DW_AT_type        : <0x1d5>
    <4de>   DW_AT_data_member_location: 88
 <2><4df>: Abbrev Number: 11 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x3e6): _mbstate
    <4e4>   DW_AT_decl_file   : 4
    <4e5>   DW_AT_decl_line   : 233
    <4e6>   DW_AT_decl_column : 14
    <4e7>   DW_AT_type        : <0x1af>
    <4eb>   DW_AT_data_member_location: 92
 <2><4ec>: Abbrev Number: 11 (DW_TAG_member)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x323): _flags2
    <4f1>   DW_AT_decl_file   : 4
    <4f2>   DW_AT_decl_line   : 234
    <4f3>   DW_AT_decl_column : 9
    <4f4>   DW_AT_type        : <0xdb>
    <4f8>   DW_AT_data_member_location: 100
 <2><4f9>: Abbrev Number: 0
 <1><4fa>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <4fb>   DW_AT_prototyped  : 1
    <4fb>   DW_AT_type        : <0xdb>
    <4ff>   DW_AT_sibling     : <0x518>
 <2><503>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <504>   DW_AT_type        : <0x518>
 <2><508>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <509>   DW_AT_type        : <0x1bb>
 <2><50d>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <50e>   DW_AT_type        : <0x667>
 <2><512>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <513>   DW_AT_type        : <0xdb>
 <2><517>: Abbrev Number: 0
 <1><518>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <519>   DW_AT_byte_size   : 4
    <51a>   DW_AT_type        : <0x51e>
 <1><51e>: Abbrev Number: 21 (DW_TAG_structure_type)
    <51f>   DW_AT_name        : (indirect string, offset: 0x864): _reent
    <523>   DW_AT_byte_size   : 1060
    <525>   DW_AT_decl_file   : 4
    <526>   DW_AT_decl_line   : 613
    <528>   DW_AT_decl_column : 8
    <529>   DW_AT_sibling     : <0x667>
 <2><52d>: Abbrev Number: 22 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x1353): _errno
    <532>   DW_AT_decl_file   : 4
    <533>   DW_AT_decl_line   : 615
    <535>   DW_AT_decl_column : 7
    <536>   DW_AT_type        : <0xdb>
    <53a>   DW_AT_data_member_location: 0
 <2><53b>: Abbrev Number: 22 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0x1dd): _stdin
    <540>   DW_AT_decl_file   : 4
    <541>   DW_AT_decl_line   : 620
    <543>   DW_AT_decl_column : 11
    <544>   DW_AT_type        : <0x753>
    <548>   DW_AT_data_member_location: 4
 <2><549>: Abbrev Number: 22 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x26a): _stdout
    <54e>   DW_AT_decl_file   : 4
    <54f>   DW_AT_decl_line   : 620
    <551>   DW_AT_decl_column : 20
    <552>   DW_AT_type        : <0x753>
    <556>   DW_AT_data_member_location: 8
 <2><557>: Abbrev Number: 22 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0x22f): _stderr
    <55c>   DW_AT_decl_file   : 4
    <55d>   DW_AT_decl_line   : 620
    <55f>   DW_AT_decl_column : 30
    <560>   DW_AT_type        : <0x753>
    <564>   DW_AT_data_member_location: 12
 <2><565>: Abbrev Number: 22 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0x407): _inc
    <56a>   DW_AT_decl_file   : 4
    <56b>   DW_AT_decl_line   : 622
    <56d>   DW_AT_decl_column : 8
    <56e>   DW_AT_type        : <0xdb>
    <572>   DW_AT_data_member_location: 16
 <2><573>: Abbrev Number: 22 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0xfd): _emergency
    <578>   DW_AT_decl_file   : 4
    <579>   DW_AT_decl_line   : 623
    <57b>   DW_AT_decl_column : 8
    <57c>   DW_AT_type        : <0x953>
    <580>   DW_AT_data_member_location: 20
 <2><581>: Abbrev Number: 22 (DW_TAG_member)
    <582>   DW_AT_name        : (indirect string, offset: 0x423): _unspecified_locale_info
    <586>   DW_AT_decl_file   : 4
    <587>   DW_AT_decl_line   : 626
    <589>   DW_AT_decl_column : 7
    <58a>   DW_AT_type        : <0xdb>
    <58e>   DW_AT_data_member_location: 48
 <2><58f>: Abbrev Number: 22 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x411): _locale
    <594>   DW_AT_decl_file   : 4
    <595>   DW_AT_decl_line   : 627
    <597>   DW_AT_decl_column : 22
    <598>   DW_AT_type        : <0x968>
    <59c>   DW_AT_data_member_location: 52
 <2><59d>: Abbrev Number: 22 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x36a): __sdidinit
    <5a2>   DW_AT_decl_file   : 4
    <5a3>   DW_AT_decl_line   : 629
    <5a5>   DW_AT_decl_column : 7
    <5a6>   DW_AT_type        : <0xdb>
    <5aa>   DW_AT_data_member_location: 56
 <2><5ab>: Abbrev Number: 22 (DW_TAG_member)
    <5ac>   DW_AT_name        : (indirect string, offset: 0x419): __cleanup
    <5b0>   DW_AT_decl_file   : 4
    <5b1>   DW_AT_decl_line   : 631
    <5b3>   DW_AT_decl_column : 10
    <5b4>   DW_AT_type        : <0x979>
    <5b8>   DW_AT_data_member_location: 60
 <2><5b9>: Abbrev Number: 22 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x2a3): _result
    <5be>   DW_AT_decl_file   : 4
    <5bf>   DW_AT_decl_line   : 634
    <5c1>   DW_AT_decl_column : 19
    <5c2>   DW_AT_type        : <0x23b>
    <5c6>   DW_AT_data_member_location: 64
 <2><5c7>: Abbrev Number: 22 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0x254): _result_k
    <5cc>   DW_AT_decl_file   : 4
    <5cd>   DW_AT_decl_line   : 635
    <5cf>   DW_AT_decl_column : 7
    <5d0>   DW_AT_type        : <0xdb>
    <5d4>   DW_AT_data_member_location: 68
 <2><5d5>: Abbrev Number: 22 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x545): _p5s
    <5da>   DW_AT_decl_file   : 4
    <5db>   DW_AT_decl_line   : 636
    <5dd>   DW_AT_decl_column : 19
    <5de>   DW_AT_type        : <0x23b>
    <5e2>   DW_AT_data_member_location: 72
 <2><5e3>: Abbrev Number: 22 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x375): _freelist
    <5e8>   DW_AT_decl_file   : 4
    <5e9>   DW_AT_decl_line   : 637
    <5eb>   DW_AT_decl_column : 20
    <5ec>   DW_AT_type        : <0x97f>
    <5f0>   DW_AT_data_member_location: 76
 <2><5f1>: Abbrev Number: 22 (DW_TAG_member)
    <5f2>   DW_AT_name        : (indirect string, offset: 0x272): _cvtlen
    <5f6>   DW_AT_decl_file   : 4
    <5f7>   DW_AT_decl_line   : 640
    <5f9>   DW_AT_decl_column : 7
    <5fa>   DW_AT_type        : <0xdb>
    <5fe>   DW_AT_data_member_location: 80
 <2><5ff>: Abbrev Number: 22 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0x1e4): _cvtbuf
    <604>   DW_AT_decl_file   : 4
    <605>   DW_AT_decl_line   : 641
    <607>   DW_AT_decl_column : 9
    <608>   DW_AT_type        : <0x667>
    <60c>   DW_AT_data_member_location: 84
 <2><60d>: Abbrev Number: 22 (DW_TAG_member)
    <60e>   DW_AT_name        : (indirect string, offset: 0x3a7): _new
    <612>   DW_AT_decl_file   : 4
    <613>   DW_AT_decl_line   : 676
    <615>   DW_AT_decl_column : 7
    <616>   DW_AT_type        : <0x92e>
    <61a>   DW_AT_data_member_location: 88
 <2><61b>: Abbrev Number: 23 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0x362): _atexit
    <620>   DW_AT_decl_file   : 4
    <621>   DW_AT_decl_line   : 680
    <623>   DW_AT_decl_column : 19
    <624>   DW_AT_type        : <0x36c>
    <628>   DW_AT_data_member_location: 328
 <2><62a>: Abbrev Number: 23 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x281): _atexit0
    <62f>   DW_AT_decl_file   : 4
    <630>   DW_AT_decl_line   : 681
    <632>   DW_AT_decl_column : 18
    <633>   DW_AT_type        : <0x329>
    <637>   DW_AT_data_member_location: 332
 <2><639>: Abbrev Number: 23 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0x4f9): _sig_func
    <63e>   DW_AT_decl_file   : 4
    <63f>   DW_AT_decl_line   : 685
    <641>   DW_AT_decl_column : 12
    <642>   DW_AT_type        : <0x990>
    <646>   DW_AT_data_member_location: 732
 <2><648>: Abbrev Number: 23 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0x1c6): __sglue
    <64d>   DW_AT_decl_file   : 4
    <64e>   DW_AT_decl_line   : 690
    <650>   DW_AT_decl_column : 16
    <651>   DW_AT_type        : <0x714>
    <655>   DW_AT_data_member_location: 736
 <2><657>: Abbrev Number: 23 (DW_TAG_member)
    <658>   DW_AT_name        : (indirect string, offset: 0x1a1): __sf
    <65c>   DW_AT_decl_file   : 4
    <65d>   DW_AT_decl_line   : 692
    <65f>   DW_AT_decl_column : 10
    <660>   DW_AT_type        : <0x99c>
    <664>   DW_AT_data_member_location: 748
 <2><666>: Abbrev Number: 0
 <1><667>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <668>   DW_AT_byte_size   : 4
    <669>   DW_AT_type        : <0x66d>
 <1><66d>: Abbrev Number: 4 (DW_TAG_base_type)
    <66e>   DW_AT_byte_size   : 1
    <66f>   DW_AT_encoding    : 6	(signed char)
    <670>   DW_AT_name        : (indirect string, offset: 0x98): char
 <1><674>: Abbrev Number: 24 (DW_TAG_const_type)
    <675>   DW_AT_type        : <0x66d>
 <1><679>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <67a>   DW_AT_byte_size   : 4
    <67b>   DW_AT_type        : <0x4fa>
 <1><67f>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <680>   DW_AT_prototyped  : 1
    <680>   DW_AT_type        : <0xdb>
    <684>   DW_AT_sibling     : <0x69d>
 <2><688>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <689>   DW_AT_type        : <0x518>
 <2><68d>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <68e>   DW_AT_type        : <0x1bb>
 <2><692>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <693>   DW_AT_type        : <0x69d>
 <2><697>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <698>   DW_AT_type        : <0xdb>
 <2><69c>: Abbrev Number: 0
 <1><69d>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <69e>   DW_AT_byte_size   : 4
    <69f>   DW_AT_type        : <0x674>
 <1><6a3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6a4>   DW_AT_byte_size   : 4
    <6a5>   DW_AT_type        : <0x67f>
 <1><6a9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <6aa>   DW_AT_prototyped  : 1
    <6aa>   DW_AT_type        : <0x14d>
    <6ae>   DW_AT_sibling     : <0x6c7>
 <2><6b2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6b3>   DW_AT_type        : <0x518>
 <2><6b7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6b8>   DW_AT_type        : <0x1bb>
 <2><6bc>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6bd>   DW_AT_type        : <0x14d>
 <2><6c1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6c2>   DW_AT_type        : <0xdb>
 <2><6c6>: Abbrev Number: 0
 <1><6c7>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6c8>   DW_AT_byte_size   : 4
    <6c9>   DW_AT_type        : <0x6a9>
 <1><6cd>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <6ce>   DW_AT_prototyped  : 1
    <6ce>   DW_AT_type        : <0xdb>
    <6d2>   DW_AT_sibling     : <0x6e1>
 <2><6d6>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6d7>   DW_AT_type        : <0x518>
 <2><6db>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6dc>   DW_AT_type        : <0x1bb>
 <2><6e0>: Abbrev Number: 0
 <1><6e1>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6e2>   DW_AT_byte_size   : 4
    <6e3>   DW_AT_type        : <0x6cd>
 <1><6e7>: Abbrev Number: 8 (DW_TAG_array_type)
    <6e8>   DW_AT_type        : <0x11e>
    <6ec>   DW_AT_sibling     : <0x6f7>
 <2><6f0>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <6f1>   DW_AT_type        : <0xee>
    <6f5>   DW_AT_upper_bound : 2
 <2><6f6>: Abbrev Number: 0
 <1><6f7>: Abbrev Number: 8 (DW_TAG_array_type)
    <6f8>   DW_AT_type        : <0x11e>
    <6fc>   DW_AT_sibling     : <0x707>
 <2><700>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <701>   DW_AT_type        : <0xee>
    <705>   DW_AT_upper_bound : 0
 <2><706>: Abbrev Number: 0
 <1><707>: Abbrev Number: 5 (DW_TAG_typedef)
    <708>   DW_AT_name        : (indirect string, offset: 0x3cc): __FILE
    <70c>   DW_AT_decl_file   : 4
    <70d>   DW_AT_decl_line   : 292
    <70f>   DW_AT_decl_column : 26
    <710>   DW_AT_type        : <0x3b7>
 <1><714>: Abbrev Number: 25 (DW_TAG_structure_type)
    <715>   DW_AT_name        : (indirect string, offset: 0x1111): _glue
    <719>   DW_AT_byte_size   : 12
    <71a>   DW_AT_decl_file   : 4
    <71b>   DW_AT_decl_line   : 296
    <71d>   DW_AT_decl_column : 8
    <71e>   DW_AT_sibling     : <0x74d>
 <2><722>: Abbrev Number: 22 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x3f4): _next
    <727>   DW_AT_decl_file   : 4
    <728>   DW_AT_decl_line   : 298
    <72a>   DW_AT_decl_column : 17
    <72b>   DW_AT_type        : <0x74d>
    <72f>   DW_AT_data_member_location: 0
 <2><730>: Abbrev Number: 22 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x27a): _niobs
    <735>   DW_AT_decl_file   : 4
    <736>   DW_AT_decl_line   : 299
    <738>   DW_AT_decl_column : 7
    <739>   DW_AT_type        : <0xdb>
    <73d>   DW_AT_data_member_location: 4
 <2><73e>: Abbrev Number: 22 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x3c6): _iobs
    <743>   DW_AT_decl_file   : 4
    <744>   DW_AT_decl_line   : 300
    <746>   DW_AT_decl_column : 11
    <747>   DW_AT_type        : <0x753>
    <74b>   DW_AT_data_member_location: 8
 <2><74c>: Abbrev Number: 0
 <1><74d>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <74e>   DW_AT_byte_size   : 4
    <74f>   DW_AT_type        : <0x714>
 <1><753>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <754>   DW_AT_byte_size   : 4
    <755>   DW_AT_type        : <0x707>
 <1><759>: Abbrev Number: 25 (DW_TAG_structure_type)
    <75a>   DW_AT_name        : (indirect string, offset: 0xf5): _rand48
    <75e>   DW_AT_byte_size   : 14
    <75f>   DW_AT_decl_file   : 4
    <760>   DW_AT_decl_line   : 324
    <762>   DW_AT_decl_column : 8
    <763>   DW_AT_sibling     : <0x792>
 <2><767>: Abbrev Number: 22 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x444): _seed
    <76c>   DW_AT_decl_file   : 4
    <76d>   DW_AT_decl_line   : 325
    <76f>   DW_AT_decl_column : 18
    <770>   DW_AT_type        : <0x792>
    <774>   DW_AT_data_member_location: 0
 <2><775>: Abbrev Number: 22 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0x471): _mult
    <77a>   DW_AT_decl_file   : 4
    <77b>   DW_AT_decl_line   : 326
    <77d>   DW_AT_decl_column : 18
    <77e>   DW_AT_type        : <0x792>
    <782>   DW_AT_data_member_location: 6
 <2><783>: Abbrev Number: 22 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x48d): _add
    <788>   DW_AT_decl_file   : 4
    <789>   DW_AT_decl_line   : 327
    <78b>   DW_AT_decl_column : 18
    <78c>   DW_AT_type        : <0x12c>
    <790>   DW_AT_data_member_location: 12
 <2><791>: Abbrev Number: 0
 <1><792>: Abbrev Number: 8 (DW_TAG_array_type)
    <793>   DW_AT_type        : <0x12c>
    <797>   DW_AT_sibling     : <0x7a2>
 <2><79b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <79c>   DW_AT_type        : <0xee>
    <7a0>   DW_AT_upper_bound : 2
 <2><7a1>: Abbrev Number: 0
 <1><7a2>: Abbrev Number: 26 (DW_TAG_structure_type)
    <7a3>   DW_AT_byte_size   : 204
    <7a4>   DW_AT_decl_file   : 4
    <7a5>   DW_AT_decl_line   : 645
    <7a7>   DW_AT_decl_column : 7
    <7a8>   DW_AT_sibling     : <0x8b7>
 <2><7ac>: Abbrev Number: 22 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x4a7): _unused_rand
    <7b1>   DW_AT_decl_file   : 4
    <7b2>   DW_AT_decl_line   : 647
    <7b4>   DW_AT_decl_column : 24
    <7b5>   DW_AT_type        : <0xee>
    <7b9>   DW_AT_data_member_location: 0
 <2><7ba>: Abbrev Number: 22 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x477): _strtok_last
    <7bf>   DW_AT_decl_file   : 4
    <7c0>   DW_AT_decl_line   : 648
    <7c2>   DW_AT_decl_column : 18
    <7c3>   DW_AT_type        : <0x667>
    <7c7>   DW_AT_data_member_location: 4
 <2><7c8>: Abbrev Number: 22 (DW_TAG_member)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x296): _asctime_buf
    <7cd>   DW_AT_decl_file   : 4
    <7ce>   DW_AT_decl_line   : 649
    <7d0>   DW_AT_decl_column : 16
    <7d1>   DW_AT_type        : <0x8b7>
    <7d5>   DW_AT_data_member_location: 8
 <2><7d6>: Abbrev Number: 22 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x51c): _localtime_buf
    <7db>   DW_AT_decl_file   : 4
    <7dc>   DW_AT_decl_line   : 650
    <7de>   DW_AT_decl_column : 23
    <7df>   DW_AT_type        : <0x251>
    <7e3>   DW_AT_data_member_location: 36
 <2><7e4>: Abbrev Number: 22 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x23f): _gamma_signgam
    <7e9>   DW_AT_decl_file   : 4
    <7ea>   DW_AT_decl_line   : 651
    <7ec>   DW_AT_decl_column : 15
    <7ed>   DW_AT_type        : <0xdb>
    <7f1>   DW_AT_data_member_location: 72
 <2><7f2>: Abbrev Number: 22 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x3ef): _rand_next
    <7f7>   DW_AT_decl_file   : 4
    <7f8>   DW_AT_decl_line   : 652
    <7fa>   DW_AT_decl_column : 44
    <7fb>   DW_AT_type        : <0x13a>
    <7ff>   DW_AT_data_member_location: 76
 <2><800>: Abbrev Number: 22 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x532): _r48
    <805>   DW_AT_decl_file   : 4
    <806>   DW_AT_decl_line   : 653
    <808>   DW_AT_decl_column : 26
    <809>   DW_AT_type        : <0x759>
    <80d>   DW_AT_data_member_location: 84
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x3fa): _mblen_state
    <813>   DW_AT_decl_file   : 4
    <814>   DW_AT_decl_line   : 654
    <816>   DW_AT_decl_column : 22
    <817>   DW_AT_type        : <0x1af>
    <81b>   DW_AT_data_member_location: 100
 <2><81c>: Abbrev Number: 22 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x537): _mbtowc_state
    <821>   DW_AT_decl_file   : 4
    <822>   DW_AT_decl_line   : 655
    <824>   DW_AT_decl_column : 22
    <825>   DW_AT_type        : <0x1af>
    <829>   DW_AT_data_member_location: 108
 <2><82a>: Abbrev Number: 22 (DW_TAG_member)
    <82b>   DW_AT_name        : (indirect string, offset: 0x17a): _wctomb_state
    <82f>   DW_AT_decl_file   : 4
    <830>   DW_AT_decl_line   : 656
    <832>   DW_AT_decl_column : 22
    <833>   DW_AT_type        : <0x1af>
    <837>   DW_AT_data_member_location: 116
 <2><838>: Abbrev Number: 22 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x4ef): _l64a_buf
    <83d>   DW_AT_decl_file   : 4
    <83e>   DW_AT_decl_line   : 657
    <840>   DW_AT_decl_column : 16
    <841>   DW_AT_type        : <0x8c7>
    <845>   DW_AT_data_member_location: 124
 <2><846>: Abbrev Number: 22 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0x28a): _signal_buf
    <84b>   DW_AT_decl_file   : 4
    <84c>   DW_AT_decl_line   : 658
    <84e>   DW_AT_decl_column : 16
    <84f>   DW_AT_type        : <0x8d7>
    <853>   DW_AT_data_member_location: 132
 <2><854>: Abbrev Number: 22 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x49a): _getdate_err
    <859>   DW_AT_decl_file   : 4
    <85a>   DW_AT_decl_line   : 659
    <85c>   DW_AT_decl_column : 15
    <85d>   DW_AT_type        : <0xdb>
    <861>   DW_AT_data_member_location: 156
 <2><862>: Abbrev Number: 22 (DW_TAG_member)
    <863>   DW_AT_name        : (indirect string, offset: 0x205): _mbrlen_state
    <867>   DW_AT_decl_file   : 4
    <868>   DW_AT_decl_line   : 660
    <86a>   DW_AT_decl_column : 22
    <86b>   DW_AT_type        : <0x1af>
    <86f>   DW_AT_data_member_location: 160
 <2><870>: Abbrev Number: 22 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x16b): _mbrtowc_state
    <875>   DW_AT_decl_file   : 4
    <876>   DW_AT_decl_line   : 661
    <878>   DW_AT_decl_column : 22
    <879>   DW_AT_type        : <0x1af>
    <87d>   DW_AT_data_member_location: 168
 <2><87e>: Abbrev Number: 22 (DW_TAG_member)
    <87f>   DW_AT_name        : (indirect string, offset: 0x1f4): _mbsrtowcs_state
    <883>   DW_AT_decl_file   : 4
    <884>   DW_AT_decl_line   : 662
    <886>   DW_AT_decl_column : 22
    <887>   DW_AT_type        : <0x1af>
    <88b>   DW_AT_data_member_location: 176
 <2><88c>: Abbrev Number: 22 (DW_TAG_member)
    <88d>   DW_AT_name        : (indirect string, offset: 0x108): _wcrtomb_state
    <891>   DW_AT_decl_file   : 4
    <892>   DW_AT_decl_line   : 663
    <894>   DW_AT_decl_column : 22
    <895>   DW_AT_type        : <0x1af>
    <899>   DW_AT_data_member_location: 184
 <2><89a>: Abbrev Number: 22 (DW_TAG_member)
    <89b>   DW_AT_name        : (indirect string, offset: 0x117): _wcsrtombs_state
    <89f>   DW_AT_decl_file   : 4
    <8a0>   DW_AT_decl_line   : 664
    <8a2>   DW_AT_decl_column : 22
    <8a3>   DW_AT_type        : <0x1af>
    <8a7>   DW_AT_data_member_location: 192
 <2><8a8>: Abbrev Number: 22 (DW_TAG_member)
    <8a9>   DW_AT_name        : (indirect string, offset: 0x3ac): _h_errno
    <8ad>   DW_AT_decl_file   : 4
    <8ae>   DW_AT_decl_line   : 665
    <8b0>   DW_AT_decl_column : 8
    <8b1>   DW_AT_type        : <0xdb>
    <8b5>   DW_AT_data_member_location: 200
 <2><8b6>: Abbrev Number: 0
 <1><8b7>: Abbrev Number: 8 (DW_TAG_array_type)
    <8b8>   DW_AT_type        : <0x66d>
    <8bc>   DW_AT_sibling     : <0x8c7>
 <2><8c0>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <8c1>   DW_AT_type        : <0xee>
    <8c5>   DW_AT_upper_bound : 25
 <2><8c6>: Abbrev Number: 0
 <1><8c7>: Abbrev Number: 8 (DW_TAG_array_type)
    <8c8>   DW_AT_type        : <0x66d>
    <8cc>   DW_AT_sibling     : <0x8d7>
 <2><8d0>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <8d1>   DW_AT_type        : <0xee>
    <8d5>   DW_AT_upper_bound : 7
 <2><8d6>: Abbrev Number: 0
 <1><8d7>: Abbrev Number: 8 (DW_TAG_array_type)
    <8d8>   DW_AT_type        : <0x66d>
    <8dc>   DW_AT_sibling     : <0x8e7>
 <2><8e0>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <8e1>   DW_AT_type        : <0xee>
    <8e5>   DW_AT_upper_bound : 23
 <2><8e6>: Abbrev Number: 0
 <1><8e7>: Abbrev Number: 26 (DW_TAG_structure_type)
    <8e8>   DW_AT_byte_size   : 240
    <8e9>   DW_AT_decl_file   : 4
    <8ea>   DW_AT_decl_line   : 670
    <8ec>   DW_AT_decl_column : 7
    <8ed>   DW_AT_sibling     : <0x90e>
 <2><8f1>: Abbrev Number: 22 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x352): _nextf
    <8f6>   DW_AT_decl_file   : 4
    <8f7>   DW_AT_decl_line   : 673
    <8f9>   DW_AT_decl_column : 27
    <8fa>   DW_AT_type        : <0x90e>
    <8fe>   DW_AT_data_member_location: 0
 <2><8ff>: Abbrev Number: 22 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x4e6): _nmalloc
    <904>   DW_AT_decl_file   : 4
    <905>   DW_AT_decl_line   : 674
    <907>   DW_AT_decl_column : 24
    <908>   DW_AT_type        : <0x91e>
    <90c>   DW_AT_data_member_location: 120
 <2><90d>: Abbrev Number: 0
 <1><90e>: Abbrev Number: 8 (DW_TAG_array_type)
    <90f>   DW_AT_type        : <0x3b1>
    <913>   DW_AT_sibling     : <0x91e>
 <2><917>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <918>   DW_AT_type        : <0xee>
    <91c>   DW_AT_upper_bound : 29
 <2><91d>: Abbrev Number: 0
 <1><91e>: Abbrev Number: 8 (DW_TAG_array_type)
    <91f>   DW_AT_type        : <0xee>
    <923>   DW_AT_sibling     : <0x92e>
 <2><927>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <928>   DW_AT_type        : <0xee>
    <92c>   DW_AT_upper_bound : 29
 <2><92d>: Abbrev Number: 0
 <1><92e>: Abbrev Number: 27 (DW_TAG_union_type)
    <92f>   DW_AT_byte_size   : 240
    <930>   DW_AT_decl_file   : 4
    <931>   DW_AT_decl_line   : 643
    <933>   DW_AT_decl_column : 3
    <934>   DW_AT_sibling     : <0x953>
 <2><938>: Abbrev Number: 28 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x864): _reent
    <93d>   DW_AT_decl_file   : 4
    <93e>   DW_AT_decl_line   : 666
    <940>   DW_AT_decl_column : 11
    <941>   DW_AT_type        : <0x7a2>
 <2><945>: Abbrev Number: 28 (DW_TAG_member)
    <946>   DW_AT_name        : (indirect string, offset: 0x509): _unused
    <94a>   DW_AT_decl_file   : 4
    <94b>   DW_AT_decl_line   : 675
    <94d>   DW_AT_decl_column : 11
    <94e>   DW_AT_type        : <0x8e7>
 <2><952>: Abbrev Number: 0
 <1><953>: Abbrev Number: 8 (DW_TAG_array_type)
    <954>   DW_AT_type        : <0x66d>
    <958>   DW_AT_sibling     : <0x963>
 <2><95c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <95d>   DW_AT_type        : <0xee>
    <961>   DW_AT_upper_bound : 24
 <2><962>: Abbrev Number: 0
 <1><963>: Abbrev Number: 29 (DW_TAG_structure_type)
    <964>   DW_AT_name        : (indirect string, offset: 0x139): __locale_t
    <968>   DW_AT_declaration : 1
 <1><968>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <969>   DW_AT_byte_size   : 4
    <96a>   DW_AT_type        : <0x963>
 <1><96e>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <96f>   DW_AT_prototyped  : 1
    <96f>   DW_AT_sibling     : <0x979>
 <2><973>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <974>   DW_AT_type        : <0x518>
 <2><978>: Abbrev Number: 0
 <1><979>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <97a>   DW_AT_byte_size   : 4
    <97b>   DW_AT_type        : <0x96e>
 <1><97f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <980>   DW_AT_byte_size   : 4
    <981>   DW_AT_type        : <0x23b>
 <1><985>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <986>   DW_AT_prototyped  : 1
    <986>   DW_AT_sibling     : <0x990>
 <2><98a>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <98b>   DW_AT_type        : <0xdb>
 <2><98f>: Abbrev Number: 0
 <1><990>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <991>   DW_AT_byte_size   : 4
    <992>   DW_AT_type        : <0x996>
 <1><996>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <997>   DW_AT_byte_size   : 4
    <998>   DW_AT_type        : <0x985>
 <1><99c>: Abbrev Number: 8 (DW_TAG_array_type)
    <99d>   DW_AT_type        : <0x707>
    <9a1>   DW_AT_sibling     : <0x9ac>
 <2><9a5>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <9a6>   DW_AT_type        : <0xee>
    <9aa>   DW_AT_upper_bound : 2
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 31 (DW_TAG_variable)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x77d): _impure_ptr
    <9b1>   DW_AT_decl_file   : 4
    <9b2>   DW_AT_decl_line   : 819
    <9b4>   DW_AT_decl_column : 23
    <9b5>   DW_AT_type        : <0x518>
    <9b9>   DW_AT_external    : 1
    <9b9>   DW_AT_declaration : 1
 <1><9b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x3ce): FILE
    <9be>   DW_AT_decl_file   : 6
    <9bf>   DW_AT_decl_line   : 66
    <9c0>   DW_AT_decl_column : 16
    <9c1>   DW_AT_type        : <0x707>
 <1><9c5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x3a0): __siov
    <9ca>   DW_AT_byte_size   : 8
    <9cb>   DW_AT_decl_file   : 7
    <9cc>   DW_AT_decl_line   : 24
    <9cd>   DW_AT_decl_column : 8
    <9ce>   DW_AT_sibling     : <0x9ed>
 <2><9d2>: Abbrev Number: 11 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x333): iov_base
    <9d7>   DW_AT_decl_file   : 7
    <9d8>   DW_AT_decl_line   : 25
    <9d9>   DW_AT_decl_column : 14
    <9da>   DW_AT_type        : <0x9ed>
    <9de>   DW_AT_data_member_location: 0
 <2><9df>: Abbrev Number: 11 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x391): iov_len
    <9e4>   DW_AT_decl_file   : 7
    <9e5>   DW_AT_decl_line   : 26
    <9e6>   DW_AT_decl_column : 9
    <9e7>   DW_AT_type        : <0xe2>
    <9eb>   DW_AT_data_member_location: 4
 <2><9ec>: Abbrev Number: 0
 <1><9ed>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <9ee>   DW_AT_byte_size   : 4
    <9ef>   DW_AT_type        : <0x9f3>
 <1><9f3>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><9f4>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x399): __suio
    <9f9>   DW_AT_byte_size   : 12
    <9fa>   DW_AT_decl_file   : 7
    <9fb>   DW_AT_decl_line   : 28
    <9fc>   DW_AT_decl_column : 8
    <9fd>   DW_AT_sibling     : <0xa29>
 <2><a01>: Abbrev Number: 11 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0x128): uio_iov
    <a06>   DW_AT_decl_file   : 7
    <a07>   DW_AT_decl_line   : 29
    <a08>   DW_AT_decl_column : 17
    <a09>   DW_AT_type        : <0xa29>
    <a0d>   DW_AT_data_member_location: 0
 <2><a0e>: Abbrev Number: 11 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0xda): uio_iovcnt
    <a13>   DW_AT_decl_file   : 7
    <a14>   DW_AT_decl_line   : 30
    <a15>   DW_AT_decl_column : 6
    <a16>   DW_AT_type        : <0xdb>
    <a1a>   DW_AT_data_member_location: 4
 <2><a1b>: Abbrev Number: 11 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x1bc): uio_resid
    <a20>   DW_AT_decl_file   : 7
    <a21>   DW_AT_decl_line   : 31
    <a22>   DW_AT_decl_column : 9
    <a23>   DW_AT_type        : <0xe2>
    <a27>   DW_AT_data_member_location: 8
 <2><a28>: Abbrev Number: 0
 <1><a29>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <a2a>   DW_AT_byte_size   : 4
    <a2b>   DW_AT_type        : <0x9c5>
 <1><a2f>: Abbrev Number: 33 (DW_TAG_subprogram)
    <a30>   DW_AT_external    : 1
    <a30>   DW_AT_name        : (indirect string, offset: 0x34d): puts
    <a34>   DW_AT_decl_file   : 6
    <a35>   DW_AT_decl_line   : 221
    <a36>   DW_AT_decl_column : 5
    <a37>   DW_AT_prototyped  : 1
    <a37>   DW_AT_type        : <0xdb>
    <a3b>   DW_AT_low_pc      : 0x1a8
    <a3f>   DW_AT_high_pc     : 0x1c
    <a43>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a45>   DW_AT_GNU_all_tail_call_sites: 1
    <a45>   DW_AT_sibling     : <0xa57>
 <2><a49>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <a4a>   DW_AT_name        : s
    <a4c>   DW_AT_decl_file   : 1
    <a4d>   DW_AT_decl_line   : 127
    <a4e>   DW_AT_decl_column : 20
    <a4f>   DW_AT_type        : <0x69d>
    <a53>   DW_AT_location    : 2 byte block: 70 7c 	(DW_OP_breg0 (r0): -4)
 <2><a56>: Abbrev Number: 0
 <1><a57>: Abbrev Number: 35 (DW_TAG_subprogram)
    <a58>   DW_AT_external    : 1
    <a58>   DW_AT_name        : (indirect string, offset: 0x32b): _puts_r
    <a5c>   DW_AT_decl_file   : 6
    <a5d>   DW_AT_decl_line   : 465
    <a5f>   DW_AT_decl_column : 5
    <a60>   DW_AT_prototyped  : 1
    <a60>   DW_AT_type        : <0xdb>
    <a64>   DW_AT_low_pc      : 0x70
    <a68>   DW_AT_high_pc     : 0x138
    <a6c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a6e>   DW_AT_GNU_all_tail_call_sites: 1
    <a6e>   DW_AT_sibling     : <0xaf0>
 <2><a72>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <a73>   DW_AT_name        : ptr
    <a77>   DW_AT_decl_file   : 1
    <a78>   DW_AT_decl_line   : 68
    <a79>   DW_AT_decl_column : 25
    <a7a>   DW_AT_type        : <0x518>
    <a7e>   DW_AT_location    : 2 byte block: 70 50 	(DW_OP_breg0 (r0): -48)
 <2><a81>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <a82>   DW_AT_name        : s
    <a84>   DW_AT_decl_file   : 1
    <a85>   DW_AT_decl_line   : 69
    <a86>   DW_AT_decl_column : 21
    <a87>   DW_AT_type        : <0x69d>
    <a8b>   DW_AT_location    : 2 byte block: 70 4c 	(DW_OP_breg0 (r0): -52)
 <2><a8e>: Abbrev Number: 36 (DW_TAG_variable)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x2a4): result
    <a93>   DW_AT_decl_file   : 1
    <a94>   DW_AT_decl_line   : 72
    <a95>   DW_AT_decl_column : 7
    <a96>   DW_AT_type        : <0xdb>
    <a9a>   DW_AT_location    : 2 byte block: 70 70 	(DW_OP_breg0 (r0): -16)
 <2><a9d>: Abbrev Number: 37 (DW_TAG_variable)
    <a9e>   DW_AT_name        : c
    <aa0>   DW_AT_decl_file   : 1
    <aa1>   DW_AT_decl_line   : 73
    <aa2>   DW_AT_decl_column : 10
    <aa3>   DW_AT_type        : <0xe2>
    <aa7>   DW_AT_location    : 2 byte block: 70 7c 	(DW_OP_breg0 (r0): -4)
 <2><aaa>: Abbrev Number: 37 (DW_TAG_variable)
    <aab>   DW_AT_name        : uio
    <aaf>   DW_AT_decl_file   : 1
    <ab0>   DW_AT_decl_line   : 74
    <ab1>   DW_AT_decl_column : 17
    <ab2>   DW_AT_type        : <0x9f4>
    <ab6>   DW_AT_location    : 2 byte block: 70 64 	(DW_OP_breg0 (r0): -28)
 <2><ab9>: Abbrev Number: 37 (DW_TAG_variable)
    <aba>   DW_AT_name        : iov
    <abe>   DW_AT_decl_file   : 1
    <abf>   DW_AT_decl_line   : 75
    <ac0>   DW_AT_decl_column : 17
    <ac1>   DW_AT_type        : <0xaf0>
    <ac5>   DW_AT_location    : 2 byte block: 70 54 	(DW_OP_breg0 (r0): -44)
 <2><ac8>: Abbrev Number: 37 (DW_TAG_variable)
    <ac9>   DW_AT_name        : fp
    <acc>   DW_AT_decl_file   : 1
    <acd>   DW_AT_decl_line   : 76
    <ace>   DW_AT_decl_column : 9
    <acf>   DW_AT_type        : <0xb00>
    <ad3>   DW_AT_location    : 2 byte block: 70 78 	(DW_OP_breg0 (r0): -8)
 <2><ad6>: Abbrev Number: 38 (DW_TAG_lexical_block)
    <ad7>   DW_AT_low_pc      : 0xec
    <adb>   DW_AT_high_pc     : 0x2c
 <3><adf>: Abbrev Number: 36 (DW_TAG_variable)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xe5): _check_init_ptr
    <ae4>   DW_AT_decl_file   : 1
    <ae5>   DW_AT_decl_line   : 88
    <ae6>   DW_AT_decl_column : 3
    <ae7>   DW_AT_type        : <0x518>
    <aeb>   DW_AT_location    : 2 byte block: 70 74 	(DW_OP_breg0 (r0): -12)
 <3><aee>: Abbrev Number: 0
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 8 (DW_TAG_array_type)
    <af1>   DW_AT_type        : <0x9c5>
    <af5>   DW_AT_sibling     : <0xb00>
 <2><af9>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <afa>   DW_AT_type        : <0xee>
    <afe>   DW_AT_upper_bound : 1
 <2><aff>: Abbrev Number: 0
 <1><b00>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b01>   DW_AT_byte_size   : 4
    <b02>   DW_AT_type        : <0x9b9>
 <1><b06>: Abbrev Number: 0
  Compilation Unit @ offset 0xb07:
   Length:        0xc2 (32-bit)
   Version:       4
   Abbrev Offset: 0x277
   Pointer Size:  4
 <0><b12>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <b13>   DW_AT_producer    : (indirect string, offset: 0x4c3): GNU C17 10.2.0 -g -O0 -fno-builtin
    <b17>   DW_AT_language    : 12	(ANSI C99)
    <b18>   DW_AT_name        : (indirect string, offset: 0x55a): ../../../.././newlib/libc/string/strlen.c
    <b1c>   DW_AT_comp_dir    : (indirect string, offset: 0x58b): /media/ca850f52-0605-42a7-9fd4-899de9edf461/work/GNU_LANG/newlib-4.1.0.ft32-elf/ft32-elf/newlib/libc/string
    <b20>   DW_AT_low_pc      : 0x1c4
    <b24>   DW_AT_high_pc     : 0x48
    <b28>   DW_AT_stmt_list   : 0x390
 <1><b2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <b2d>   DW_AT_byte_size   : 4
    <b2e>   DW_AT_encoding    : 5	(signed)
    <b2f>   DW_AT_name        : int
 <1><b33>: Abbrev Number: 3 (DW_TAG_typedef)
    <b34>   DW_AT_name        : (indirect string, offset: 0x105e): size_t
    <b38>   DW_AT_decl_file   : 2
    <b39>   DW_AT_decl_line   : 209
    <b3a>   DW_AT_decl_column : 23
    <b3b>   DW_AT_type        : <0xb3f>
 <1><b3f>: Abbrev Number: 4 (DW_TAG_base_type)
    <b40>   DW_AT_byte_size   : 4
    <b41>   DW_AT_encoding    : 7	(unsigned)
    <b42>   DW_AT_name        : (indirect string, offset: 0x70): unsigned int
 <1><b46>: Abbrev Number: 4 (DW_TAG_base_type)
    <b47>   DW_AT_byte_size   : 4
    <b48>   DW_AT_encoding    : 5	(signed)
    <b49>   DW_AT_name        : (indirect string, offset: 0x58): long int
 <1><b4d>: Abbrev Number: 4 (DW_TAG_base_type)
    <b4e>   DW_AT_byte_size   : 8
    <b4f>   DW_AT_encoding    : 5	(signed)
    <b50>   DW_AT_name        : (indirect string, offset: 0x53): long long int
 <1><b54>: Abbrev Number: 4 (DW_TAG_base_type)
    <b55>   DW_AT_byte_size   : 8
    <b56>   DW_AT_encoding    : 4	(float)
    <b57>   DW_AT_name        : (indirect string, offset: 0xb0): long double
 <1><b5b>: Abbrev Number: 4 (DW_TAG_base_type)
    <b5c>   DW_AT_byte_size   : 1
    <b5d>   DW_AT_encoding    : 6	(signed char)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x91): signed char
 <1><b62>: Abbrev Number: 4 (DW_TAG_base_type)
    <b63>   DW_AT_byte_size   : 1
    <b64>   DW_AT_encoding    : 8	(unsigned char)
    <b65>   DW_AT_name        : (indirect string, offset: 0x8f): unsigned char
 <1><b69>: Abbrev Number: 4 (DW_TAG_base_type)
    <b6a>   DW_AT_byte_size   : 2
    <b6b>   DW_AT_encoding    : 5	(signed)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xbc): short int
 <1><b70>: Abbrev Number: 4 (DW_TAG_base_type)
    <b71>   DW_AT_byte_size   : 2
    <b72>   DW_AT_encoding    : 7	(unsigned)
    <b73>   DW_AT_name        : (indirect string, offset: 0x9d): short unsigned int
 <1><b77>: Abbrev Number: 4 (DW_TAG_base_type)
    <b78>   DW_AT_byte_size   : 4
    <b79>   DW_AT_encoding    : 7	(unsigned)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x6b): long unsigned int
 <1><b7e>: Abbrev Number: 4 (DW_TAG_base_type)
    <b7f>   DW_AT_byte_size   : 8
    <b80>   DW_AT_encoding    : 7	(unsigned)
    <b81>   DW_AT_name        : (indirect string, offset: 0x66): long long unsigned int
 <1><b85>: Abbrev Number: 4 (DW_TAG_base_type)
    <b86>   DW_AT_byte_size   : 1
    <b87>   DW_AT_encoding    : 6	(signed char)
    <b88>   DW_AT_name        : (indirect string, offset: 0x98): char
 <1><b8c>: Abbrev Number: 5 (DW_TAG_const_type)
    <b8d>   DW_AT_type        : <0xb85>
 <1><b91>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b92>   DW_AT_byte_size   : 4
    <b93>   DW_AT_type        : <0xb8c>
 <1><b97>: Abbrev Number: 7 (DW_TAG_subprogram)
    <b98>   DW_AT_external    : 1
    <b98>   DW_AT_name        : (indirect string, offset: 0x584): strlen
    <b9c>   DW_AT_decl_file   : 3
    <b9d>   DW_AT_decl_line   : 41
    <b9e>   DW_AT_decl_column : 9
    <b9f>   DW_AT_prototyped  : 1
    <b9f>   DW_AT_type        : <0xb33>
    <ba3>   DW_AT_low_pc      : 0x1c4
    <ba7>   DW_AT_high_pc     : 0x48
    <bab>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bad>   DW_AT_GNU_all_call_sites: 1
 <2><bad>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <bae>   DW_AT_name        : str
    <bb2>   DW_AT_decl_file   : 1
    <bb3>   DW_AT_decl_line   : 52
    <bb4>   DW_AT_decl_column : 21
    <bb5>   DW_AT_type        : <0xb91>
    <bb9>   DW_AT_location    : 2 byte block: 70 78 	(DW_OP_breg0 (r0): -8)
 <2><bbc>: Abbrev Number: 9 (DW_TAG_variable)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x554): start
    <bc1>   DW_AT_decl_file   : 1
    <bc2>   DW_AT_decl_line   : 54
    <bc3>   DW_AT_decl_column : 15
    <bc4>   DW_AT_type        : <0xb91>
    <bc8>   DW_AT_location    : 2 byte block: 70 7c 	(DW_OP_breg0 (r0): -4)
 <2><bcb>: Abbrev Number: 0
 <1><bcc>: Abbrev Number: 0
  Compilation Unit @ offset 0xbcd:
   Length:        0xcb4 (32-bit)
   Version:       4
   Abbrev Offset: 0x2fe
   Pointer Size:  4
 <0><bd8>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bd9>   DW_AT_producer    : (indirect string, offset: 0x4c3): GNU C17 10.2.0 -g -O0 -fno-builtin
    <bdd>   DW_AT_language    : 12	(ANSI C99)
    <bde>   DW_AT_name        : (indirect string, offset: 0x733): ../../../.././newlib/libc/stdio/findfp.c
    <be2>   DW_AT_comp_dir    : (indirect string, offset: 0x2b1): /media/ca850f52-0605-42a7-9fd4-899de9edf461/work/GNU_LANG/newlib-4.1.0.ft32-elf/ft32-elf/newlib/libc/stdio
    <be6>   DW_AT_low_pc      : 0x20c
    <bea>   DW_AT_high_pc     : 0x53c
    <bee>   DW_AT_stmt_list   : 0x50b
 <1><bf2>: Abbrev Number: 2 (DW_TAG_base_type)
    <bf3>   DW_AT_byte_size   : 4
    <bf4>   DW_AT_encoding    : 5	(signed)
    <bf5>   DW_AT_name        : int
 <1><bf9>: Abbrev Number: 3 (DW_TAG_base_type)
    <bfa>   DW_AT_byte_size   : 4
    <bfb>   DW_AT_encoding    : 7	(unsigned)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x70): unsigned int
 <1><c00>: Abbrev Number: 3 (DW_TAG_base_type)
    <c01>   DW_AT_byte_size   : 4
    <c02>   DW_AT_encoding    : 5	(signed)
    <c03>   DW_AT_name        : (indirect string, offset: 0x58): long int
 <1><c07>: Abbrev Number: 3 (DW_TAG_base_type)
    <c08>   DW_AT_byte_size   : 8
    <c09>   DW_AT_encoding    : 5	(signed)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x53): long long int
 <1><c0e>: Abbrev Number: 3 (DW_TAG_base_type)
    <c0f>   DW_AT_byte_size   : 8
    <c10>   DW_AT_encoding    : 4	(float)
    <c11>   DW_AT_name        : (indirect string, offset: 0xb0): long double
 <1><c15>: Abbrev Number: 4 (DW_TAG_typedef)
    <c16>   DW_AT_name        : (indirect string, offset: 0x31c): wint_t
    <c1a>   DW_AT_decl_file   : 2
    <c1b>   DW_AT_decl_line   : 350
    <c1d>   DW_AT_decl_column : 23
    <c1e>   DW_AT_type        : <0xbf9>
 <1><c22>: Abbrev Number: 3 (DW_TAG_base_type)
    <c23>   DW_AT_byte_size   : 1
    <c24>   DW_AT_encoding    : 6	(signed char)
    <c25>   DW_AT_name        : (indirect string, offset: 0x91): signed char
 <1><c29>: Abbrev Number: 3 (DW_TAG_base_type)
    <c2a>   DW_AT_byte_size   : 1
    <c2b>   DW_AT_encoding    : 8	(unsigned char)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x8f): unsigned char
 <1><c30>: Abbrev Number: 3 (DW_TAG_base_type)
    <c31>   DW_AT_byte_size   : 2
    <c32>   DW_AT_encoding    : 5	(signed)
    <c33>   DW_AT_name        : (indirect string, offset: 0xbc): short int
 <1><c37>: Abbrev Number: 3 (DW_TAG_base_type)
    <c38>   DW_AT_byte_size   : 2
    <c39>   DW_AT_encoding    : 7	(unsigned)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x9d): short unsigned int
 <1><c3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <c3f>   DW_AT_byte_size   : 4
    <c40>   DW_AT_encoding    : 7	(unsigned)
    <c41>   DW_AT_name        : (indirect string, offset: 0x6b): long unsigned int
 <1><c45>: Abbrev Number: 3 (DW_TAG_base_type)
    <c46>   DW_AT_byte_size   : 8
    <c47>   DW_AT_encoding    : 7	(unsigned)
    <c48>   DW_AT_name        : (indirect string, offset: 0x66): long long unsigned int
 <1><c4c>: Abbrev Number: 5 (DW_TAG_typedef)
    <c4d>   DW_AT_name        : (indirect string, offset: 0xf68): _off_t
    <c51>   DW_AT_decl_file   : 3
    <c52>   DW_AT_decl_line   : 46
    <c53>   DW_AT_decl_column : 14
    <c54>   DW_AT_type        : <0xc00>
 <1><c58>: Abbrev Number: 5 (DW_TAG_typedef)
    <c59>   DW_AT_name        : (indirect string, offset: 0x460): _fpos_t
    <c5d>   DW_AT_decl_file   : 3
    <c5e>   DW_AT_decl_line   : 116
    <c5f>   DW_AT_decl_column : 14
    <c60>   DW_AT_type        : <0xc00>
 <1><c64>: Abbrev Number: 6 (DW_TAG_union_type)
    <c65>   DW_AT_byte_size   : 4
    <c66>   DW_AT_decl_file   : 3
    <c67>   DW_AT_decl_line   : 165
    <c68>   DW_AT_decl_column : 3
    <c69>   DW_AT_sibling     : <0xc86>
 <2><c6d>: Abbrev Number: 7 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0x2ab): __wch
    <c72>   DW_AT_decl_file   : 3
    <c73>   DW_AT_decl_line   : 167
    <c74>   DW_AT_decl_column : 12
    <c75>   DW_AT_type        : <0xc15>
 <2><c79>: Abbrev Number: 7 (DW_TAG_member)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x263): __wchb
    <c7e>   DW_AT_decl_file   : 3
    <c7f>   DW_AT_decl_line   : 168
    <c80>   DW_AT_decl_column : 19
    <c81>   DW_AT_type        : <0xc86>
 <2><c85>: Abbrev Number: 0
 <1><c86>: Abbrev Number: 8 (DW_TAG_array_type)
    <c87>   DW_AT_type        : <0xc29>
    <c8b>   DW_AT_sibling     : <0xc96>
 <2><c8f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c90>   DW_AT_type        : <0xbf9>
    <c94>   DW_AT_upper_bound : 3
 <2><c95>: Abbrev Number: 0
 <1><c96>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c97>   DW_AT_byte_size   : 8
    <c98>   DW_AT_decl_file   : 3
    <c99>   DW_AT_decl_line   : 162
    <c9a>   DW_AT_decl_column : 9
    <c9b>   DW_AT_sibling     : <0xcba>
 <2><c9f>: Abbrev Number: 11 (DW_TAG_member)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x44a): __count
    <ca4>   DW_AT_decl_file   : 3
    <ca5>   DW_AT_decl_line   : 164
    <ca6>   DW_AT_decl_column : 7
    <ca7>   DW_AT_type        : <0xbf2>
    <cab>   DW_AT_data_member_location: 0
 <2><cac>: Abbrev Number: 11 (DW_TAG_member)
    <cad>   DW_AT_name        : (indirect string, offset: 0x452): __value
    <cb1>   DW_AT_decl_file   : 3
    <cb2>   DW_AT_decl_line   : 169
    <cb3>   DW_AT_decl_column : 5
    <cb4>   DW_AT_type        : <0xc64>
    <cb8>   DW_AT_data_member_location: 4
 <2><cb9>: Abbrev Number: 0
 <1><cba>: Abbrev Number: 5 (DW_TAG_typedef)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x3d3): _mbstate_t
    <cbf>   DW_AT_decl_file   : 3
    <cc0>   DW_AT_decl_line   : 170
    <cc1>   DW_AT_decl_column : 3
    <cc2>   DW_AT_type        : <0xc96>
 <1><cc6>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <cc7>   DW_AT_byte_size   : 4
 <1><cc8>: Abbrev Number: 5 (DW_TAG_typedef)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x492): __ULong
    <ccd>   DW_AT_decl_file   : 4
    <cce>   DW_AT_decl_line   : 22
    <ccf>   DW_AT_decl_column : 25
    <cd0>   DW_AT_type        : <0xc3e>
 <1><cd4>: Abbrev Number: 5 (DW_TAG_typedef)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x37f): _LOCK_RECURSIVE_T
    <cd9>   DW_AT_decl_file   : 5
    <cda>   DW_AT_decl_line   : 12
    <cdb>   DW_AT_decl_column : 13
    <cdc>   DW_AT_type        : <0xbf2>
 <1><ce0>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x226): _flock_t
    <ce5>   DW_AT_decl_file   : 4
    <ce6>   DW_AT_decl_line   : 35
    <ce7>   DW_AT_decl_column : 27
    <ce8>   DW_AT_type        : <0xcd4>
 <1><cec>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ced>   DW_AT_name        : (indirect string, offset: 0x237): _Bigint
    <cf1>   DW_AT_byte_size   : 24
    <cf2>   DW_AT_decl_file   : 4
    <cf3>   DW_AT_decl_line   : 52
    <cf4>   DW_AT_decl_column : 8
    <cf5>   DW_AT_sibling     : <0xd46>
 <2><cf9>: Abbrev Number: 11 (DW_TAG_member)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x3f4): _next
    <cfe>   DW_AT_decl_file   : 4
    <cff>   DW_AT_decl_line   : 54
    <d00>   DW_AT_decl_column : 19
    <d01>   DW_AT_type        : <0xd46>
    <d05>   DW_AT_data_member_location: 0
 <2><d06>: Abbrev Number: 14 (DW_TAG_member)
    <d07>   DW_AT_name        : _k
    <d0a>   DW_AT_decl_file   : 4
    <d0b>   DW_AT_decl_line   : 55
    <d0c>   DW_AT_decl_column : 7
    <d0d>   DW_AT_type        : <0xbf2>
    <d11>   DW_AT_data_member_location: 4
 <2><d12>: Abbrev Number: 11 (DW_TAG_member)
    <d13>   DW_AT_name        : (indirect string, offset: 0x43c): _maxwds
    <d17>   DW_AT_decl_file   : 4
    <d18>   DW_AT_decl_line   : 55
    <d19>   DW_AT_decl_column : 11
    <d1a>   DW_AT_type        : <0xbf2>
    <d1e>   DW_AT_data_member_location: 8
 <2><d1f>: Abbrev Number: 11 (DW_TAG_member)
    <d20>   DW_AT_name        : (indirect string, offset: 0x220): _sign
    <d24>   DW_AT_decl_file   : 4
    <d25>   DW_AT_decl_line   : 55
    <d26>   DW_AT_decl_column : 20
    <d27>   DW_AT_type        : <0xbf2>
    <d2b>   DW_AT_data_member_location: 12
 <2><d2c>: Abbrev Number: 11 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x4b4): _wds
    <d31>   DW_AT_decl_file   : 4
    <d32>   DW_AT_decl_line   : 55
    <d33>   DW_AT_decl_column : 27
    <d34>   DW_AT_type        : <0xbf2>
    <d38>   DW_AT_data_member_location: 16
 <2><d39>: Abbrev Number: 14 (DW_TAG_member)
    <d3a>   DW_AT_name        : _x
    <d3d>   DW_AT_decl_file   : 4
    <d3e>   DW_AT_decl_line   : 56
    <d3f>   DW_AT_decl_column : 11
    <d40>   DW_AT_type        : <0xd4c>
    <d44>   DW_AT_data_member_location: 20
 <2><d45>: Abbrev Number: 0
 <1><d46>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <d47>   DW_AT_byte_size   : 4
    <d48>   DW_AT_type        : <0xcec>
 <1><d4c>: Abbrev Number: 8 (DW_TAG_array_type)
    <d4d>   DW_AT_type        : <0xcc8>
    <d51>   DW_AT_sibling     : <0xd5c>
 <2><d55>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <d56>   DW_AT_type        : <0xbf9>
    <d5a>   DW_AT_upper_bound : 0
 <2><d5b>: Abbrev Number: 0
 <1><d5c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d5d>   DW_AT_name        : (indirect string, offset: 0x25e): __tm
    <d61>   DW_AT_byte_size   : 36
    <d62>   DW_AT_decl_file   : 4
    <d63>   DW_AT_decl_line   : 60
    <d64>   DW_AT_decl_column : 8
    <d65>   DW_AT_sibling     : <0xddf>
 <2><d69>: Abbrev Number: 11 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x188): __tm_sec
    <d6e>   DW_AT_decl_file   : 4
    <d6f>   DW_AT_decl_line   : 62
    <d70>   DW_AT_decl_column : 9
    <d71>   DW_AT_type        : <0xbf2>
    <d75>   DW_AT_data_member_location: 0
 <2><d76>: Abbrev Number: 11 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0x468): __tm_min
    <d7b>   DW_AT_decl_file   : 4
    <d7c>   DW_AT_decl_line   : 63
    <d7d>   DW_AT_decl_column : 9
    <d7e>   DW_AT_type        : <0xbf2>
    <d82>   DW_AT_data_member_location: 4
 <2><d83>: Abbrev Number: 11 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x197): __tm_hour
    <d88>   DW_AT_decl_file   : 4
    <d89>   DW_AT_decl_line   : 64
    <d8a>   DW_AT_decl_column : 9
    <d8b>   DW_AT_type        : <0xbf2>
    <d8f>   DW_AT_data_member_location: 8
 <2><d90>: Abbrev Number: 11 (DW_TAG_member)
    <d91>   DW_AT_name        : (indirect string, offset: 0x54a): __tm_mday
    <d95>   DW_AT_decl_file   : 4
    <d96>   DW_AT_decl_line   : 65
    <d97>   DW_AT_decl_column : 9
    <d98>   DW_AT_type        : <0xbf2>
    <d9c>   DW_AT_data_member_location: 12
 <2><d9d>: Abbrev Number: 11 (DW_TAG_member)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x359): __tm_mon
    <da2>   DW_AT_decl_file   : 4
    <da3>   DW_AT_decl_line   : 66
    <da4>   DW_AT_decl_column : 9
    <da5>   DW_AT_type        : <0xbf2>
    <da9>   DW_AT_data_member_location: 16
 <2><daa>: Abbrev Number: 11 (DW_TAG_member)
    <dab>   DW_AT_name        : (indirect string, offset: 0x343): __tm_year
    <daf>   DW_AT_decl_file   : 4
    <db0>   DW_AT_decl_line   : 67
    <db1>   DW_AT_decl_column : 9
    <db2>   DW_AT_type        : <0xbf2>
    <db6>   DW_AT_data_member_location: 20
 <2><db7>: Abbrev Number: 11 (DW_TAG_member)
    <db8>   DW_AT_name        : (indirect string, offset: 0x4b9): __tm_wday
    <dbc>   DW_AT_decl_file   : 4
    <dbd>   DW_AT_decl_line   : 68
    <dbe>   DW_AT_decl_column : 9
    <dbf>   DW_AT_type        : <0xbf2>
    <dc3>   DW_AT_data_member_location: 24
 <2><dc4>: Abbrev Number: 11 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x3b5): __tm_yday
    <dc9>   DW_AT_decl_file   : 4
    <dca>   DW_AT_decl_line   : 69
    <dcb>   DW_AT_decl_column : 9
    <dcc>   DW_AT_type        : <0xbf2>
    <dd0>   DW_AT_data_member_location: 28
 <2><dd1>: Abbrev Number: 11 (DW_TAG_member)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x511): __tm_isdst
    <dd6>   DW_AT_decl_file   : 4
    <dd7>   DW_AT_decl_line   : 70
    <dd8>   DW_AT_decl_column : 9
    <dd9>   DW_AT_type        : <0xbf2>
    <ddd>   DW_AT_data_member_location: 32
 <2><dde>: Abbrev Number: 0
 <1><ddf>: Abbrev Number: 16 (DW_TAG_structure_type)
    <de0>   DW_AT_name        : (indirect string, offset: 0x1a6): _on_exit_args
    <de4>   DW_AT_byte_size   : 264
    <de6>   DW_AT_decl_file   : 4
    <de7>   DW_AT_decl_line   : 79
    <de8>   DW_AT_decl_column : 8
    <de9>   DW_AT_sibling     : <0xe24>
 <2><ded>: Abbrev Number: 11 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0x213): _fnargs
    <df2>   DW_AT_decl_file   : 4
    <df3>   DW_AT_decl_line   : 80
    <df4>   DW_AT_decl_column : 10
    <df5>   DW_AT_type        : <0xe24>
    <df9>   DW_AT_data_member_location: 0
 <2><dfa>: Abbrev Number: 11 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0xce): _dso_handle
    <dff>   DW_AT_decl_file   : 4
    <e00>   DW_AT_decl_line   : 81
    <e01>   DW_AT_decl_column : 9
    <e02>   DW_AT_type        : <0xe24>
    <e06>   DW_AT_data_member_location: 128
 <2><e07>: Abbrev Number: 17 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0x484): _fntypes
    <e0c>   DW_AT_decl_file   : 4
    <e0d>   DW_AT_decl_line   : 83
    <e0e>   DW_AT_decl_column : 10
    <e0f>   DW_AT_type        : <0xcc8>
    <e13>   DW_AT_data_member_location: 256
 <2><e15>: Abbrev Number: 17 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x1d5): _is_cxa
    <e1a>   DW_AT_decl_file   : 4
    <e1b>   DW_AT_decl_line   : 86
    <e1c>   DW_AT_decl_column : 10
    <e1d>   DW_AT_type        : <0xcc8>
    <e21>   DW_AT_data_member_location: 260
 <2><e23>: Abbrev Number: 0
 <1><e24>: Abbrev Number: 8 (DW_TAG_array_type)
    <e25>   DW_AT_type        : <0xcc6>
    <e29>   DW_AT_sibling     : <0xe34>
 <2><e2d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <e2e>   DW_AT_type        : <0xbf9>
    <e32>   DW_AT_upper_bound : 31
 <2><e33>: Abbrev Number: 0
 <1><e34>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e35>   DW_AT_name        : (indirect string, offset: 0x362): _atexit
    <e39>   DW_AT_byte_size   : 400
    <e3b>   DW_AT_decl_file   : 4
    <e3c>   DW_AT_decl_line   : 98
    <e3d>   DW_AT_decl_column : 8
    <e3e>   DW_AT_sibling     : <0xe77>
 <2><e42>: Abbrev Number: 11 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0x3f4): _next
    <e47>   DW_AT_decl_file   : 4
    <e48>   DW_AT_decl_line   : 99
    <e49>   DW_AT_decl_column : 18
    <e4a>   DW_AT_type        : <0xe77>
    <e4e>   DW_AT_data_member_location: 0
 <2><e4f>: Abbrev Number: 11 (DW_TAG_member)
    <e50>   DW_AT_name        : (indirect string, offset: 0x40c): _ind
    <e54>   DW_AT_decl_file   : 4
    <e55>   DW_AT_decl_line   : 100
    <e56>   DW_AT_decl_column : 6
    <e57>   DW_AT_type        : <0xbf2>
    <e5b>   DW_AT_data_member_location: 4
 <2><e5c>: Abbrev Number: 11 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x21b): _fns
    <e61>   DW_AT_decl_file   : 4
    <e62>   DW_AT_decl_line   : 102
    <e63>   DW_AT_decl_column : 9
    <e64>   DW_AT_type        : <0xe7d>
    <e68>   DW_AT_data_member_location: 8
 <2><e69>: Abbrev Number: 11 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x1a6): _on_exit_args
    <e6e>   DW_AT_decl_file   : 4
    <e6f>   DW_AT_decl_line   : 103
    <e70>   DW_AT_decl_column : 30
    <e71>   DW_AT_type        : <0xddf>
    <e75>   DW_AT_data_member_location: 136
 <2><e76>: Abbrev Number: 0
 <1><e77>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e78>   DW_AT_byte_size   : 4
    <e79>   DW_AT_type        : <0xe34>
 <1><e7d>: Abbrev Number: 8 (DW_TAG_array_type)
    <e7e>   DW_AT_type        : <0xe8d>
    <e82>   DW_AT_sibling     : <0xe8d>
 <2><e86>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <e87>   DW_AT_type        : <0xbf9>
    <e8b>   DW_AT_upper_bound : 31
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e8e>   DW_AT_byte_size   : 4
    <e8f>   DW_AT_type        : <0xe93>
 <1><e93>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <e94>   DW_AT_prototyped  : 1
 <1><e94>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e95>   DW_AT_name        : (indirect string, offset: 0x3bf): __sbuf
    <e99>   DW_AT_byte_size   : 8
    <e9a>   DW_AT_decl_file   : 4
    <e9b>   DW_AT_decl_line   : 122
    <e9c>   DW_AT_decl_column : 8
    <e9d>   DW_AT_sibling     : <0xebc>
 <2><ea1>: Abbrev Number: 11 (DW_TAG_member)
    <ea2>   DW_AT_name        : (indirect string, offset: 0xb56): _base
    <ea6>   DW_AT_decl_file   : 4
    <ea7>   DW_AT_decl_line   : 123
    <ea8>   DW_AT_decl_column : 17
    <ea9>   DW_AT_type        : <0xebc>
    <ead>   DW_AT_data_member_location: 0
 <2><eae>: Abbrev Number: 11 (DW_TAG_member)
    <eaf>   DW_AT_name        : (indirect string, offset: 0xa4c): _size
    <eb3>   DW_AT_decl_file   : 4
    <eb4>   DW_AT_decl_line   : 124
    <eb5>   DW_AT_decl_column : 6
    <eb6>   DW_AT_type        : <0xbf2>
    <eba>   DW_AT_data_member_location: 4
 <2><ebb>: Abbrev Number: 0
 <1><ebc>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <ebd>   DW_AT_byte_size   : 4
    <ebe>   DW_AT_type        : <0xc29>
 <1><ec2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x3de): __sFILE
    <ec7>   DW_AT_byte_size   : 104
    <ec8>   DW_AT_decl_file   : 4
    <ec9>   DW_AT_decl_line   : 186
    <eca>   DW_AT_decl_column : 8
    <ecb>   DW_AT_sibling     : <0x1005>
 <2><ecf>: Abbrev Number: 14 (DW_TAG_member)
    <ed0>   DW_AT_name        : _p
    <ed3>   DW_AT_decl_file   : 4
    <ed4>   DW_AT_decl_line   : 187
    <ed5>   DW_AT_decl_column : 18
    <ed6>   DW_AT_type        : <0xebc>
    <eda>   DW_AT_data_member_location: 0
 <2><edb>: Abbrev Number: 14 (DW_TAG_member)
    <edc>   DW_AT_name        : _r
    <edf>   DW_AT_decl_file   : 4
    <ee0>   DW_AT_decl_line   : 188
    <ee1>   DW_AT_decl_column : 7
    <ee2>   DW_AT_type        : <0xbf2>
    <ee6>   DW_AT_data_member_location: 4
 <2><ee7>: Abbrev Number: 14 (DW_TAG_member)
    <ee8>   DW_AT_name        : _w
    <eeb>   DW_AT_decl_file   : 4
    <eec>   DW_AT_decl_line   : 189
    <eed>   DW_AT_decl_column : 7
    <eee>   DW_AT_type        : <0xbf2>
    <ef2>   DW_AT_data_member_location: 8
 <2><ef3>: Abbrev Number: 11 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x1ce): _flags
    <ef8>   DW_AT_decl_file   : 4
    <ef9>   DW_AT_decl_line   : 190
    <efa>   DW_AT_decl_column : 9
    <efb>   DW_AT_type        : <0xc30>
    <eff>   DW_AT_data_member_location: 12
 <2><f00>: Abbrev Number: 11 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0x719): _file
    <f05>   DW_AT_decl_file   : 4
    <f06>   DW_AT_decl_line   : 191
    <f07>   DW_AT_decl_column : 9
    <f08>   DW_AT_type        : <0xc30>
    <f0c>   DW_AT_data_member_location: 14
 <2><f0d>: Abbrev Number: 14 (DW_TAG_member)
    <f0e>   DW_AT_name        : _bf
    <f12>   DW_AT_decl_file   : 4
    <f13>   DW_AT_decl_line   : 192
    <f14>   DW_AT_decl_column : 17
    <f15>   DW_AT_type        : <0xe94>
    <f19>   DW_AT_data_member_location: 16
 <2><f1a>: Abbrev Number: 11 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x130): _lbfsize
    <f1f>   DW_AT_decl_file   : 4
    <f20>   DW_AT_decl_line   : 193
    <f21>   DW_AT_decl_column : 7
    <f22>   DW_AT_type        : <0xbf2>
    <f26>   DW_AT_data_member_location: 24
 <2><f27>: Abbrev Number: 11 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0x1b4): _cookie
    <f2c>   DW_AT_decl_file   : 4
    <f2d>   DW_AT_decl_line   : 200
    <f2e>   DW_AT_decl_column : 10
    <f2f>   DW_AT_type        : <0xcc6>
    <f33>   DW_AT_data_member_location: 28
 <2><f34>: Abbrev Number: 11 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0x24e): _read
    <f39>   DW_AT_decl_file   : 4
    <f3a>   DW_AT_decl_line   : 202
    <f3b>   DW_AT_decl_column : 29
    <f3c>   DW_AT_type        : <0x1189>
    <f40>   DW_AT_data_member_location: 32
 <2><f41>: Abbrev Number: 11 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0x33c): _write
    <f46>   DW_AT_decl_file   : 4
    <f47>   DW_AT_decl_line   : 204
    <f48>   DW_AT_decl_column : 29
    <f49>   DW_AT_type        : <0x11b3>
    <f4d>   DW_AT_data_member_location: 36
 <2><f4e>: Abbrev Number: 11 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x45a): _seek
    <f53>   DW_AT_decl_file   : 4
    <f54>   DW_AT_decl_line   : 207
    <f55>   DW_AT_decl_column : 13
    <f56>   DW_AT_type        : <0x11d7>
    <f5a>   DW_AT_data_member_location: 40
 <2><f5b>: Abbrev Number: 11 (DW_TAG_member)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x52b): _close
    <f60>   DW_AT_decl_file   : 4
    <f61>   DW_AT_decl_line   : 208
    <f62>   DW_AT_decl_column : 9
    <f63>   DW_AT_type        : <0x11f1>
    <f67>   DW_AT_data_member_location: 44
 <2><f68>: Abbrev Number: 14 (DW_TAG_member)
    <f69>   DW_AT_name        : _ub
    <f6d>   DW_AT_decl_file   : 4
    <f6e>   DW_AT_decl_line   : 211
    <f6f>   DW_AT_decl_column : 17
    <f70>   DW_AT_type        : <0xe94>
    <f74>   DW_AT_data_member_location: 48
 <2><f75>: Abbrev Number: 14 (DW_TAG_member)
    <f76>   DW_AT_name        : _up
    <f7a>   DW_AT_decl_file   : 4
    <f7b>   DW_AT_decl_line   : 212
    <f7c>   DW_AT_decl_column : 18
    <f7d>   DW_AT_type        : <0xebc>
    <f81>   DW_AT_data_member_location: 56
 <2><f82>: Abbrev Number: 14 (DW_TAG_member)
    <f83>   DW_AT_name        : _ur
    <f87>   DW_AT_decl_file   : 4
    <f88>   DW_AT_decl_line   : 213
    <f89>   DW_AT_decl_column : 7
    <f8a>   DW_AT_type        : <0xbf2>
    <f8e>   DW_AT_data_member_location: 60
 <2><f8f>: Abbrev Number: 11 (DW_TAG_member)
    <f90>   DW_AT_name        : (indirect string, offset: 0x191): _ubuf
    <f94>   DW_AT_decl_file   : 4
    <f95>   DW_AT_decl_line   : 216
    <f96>   DW_AT_decl_column : 17
    <f97>   DW_AT_type        : <0x11f7>
    <f9b>   DW_AT_data_member_location: 64
 <2><f9c>: Abbrev Number: 11 (DW_TAG_member)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x503): _nbuf
    <fa1>   DW_AT_decl_file   : 4
    <fa2>   DW_AT_decl_line   : 217
    <fa3>   DW_AT_decl_column : 17
    <fa4>   DW_AT_type        : <0x1207>
    <fa8>   DW_AT_data_member_location: 67
 <2><fa9>: Abbrev Number: 14 (DW_TAG_member)
    <faa>   DW_AT_name        : _lb
    <fae>   DW_AT_decl_file   : 4
    <faf>   DW_AT_decl_line   : 220
    <fb0>   DW_AT_decl_column : 17
    <fb1>   DW_AT_type        : <0xe94>
    <fb5>   DW_AT_data_member_location: 68
 <2><fb6>: Abbrev Number: 11 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x107e): _blksize
    <fbb>   DW_AT_decl_file   : 4
    <fbc>   DW_AT_decl_line   : 223
    <fbd>   DW_AT_decl_column : 7
    <fbe>   DW_AT_type        : <0xbf2>
    <fc2>   DW_AT_data_member_location: 76
 <2><fc3>: Abbrev Number: 11 (DW_TAG_member)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x1ec): _offset
    <fc8>   DW_AT_decl_file   : 4
    <fc9>   DW_AT_decl_line   : 224
    <fca>   DW_AT_decl_column : 10
    <fcb>   DW_AT_type        : <0xc4c>
    <fcf>   DW_AT_data_member_location: 80
 <2><fd0>: Abbrev Number: 11 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x871): _data
    <fd5>   DW_AT_decl_file   : 4
    <fd6>   DW_AT_decl_line   : 227
    <fd7>   DW_AT_decl_column : 18
    <fd8>   DW_AT_type        : <0x1023>
    <fdc>   DW_AT_data_member_location: 84
 <2><fdd>: Abbrev Number: 11 (DW_TAG_member)
    <fde>   DW_AT_name        : (indirect string, offset: 0xc82): _lock
    <fe2>   DW_AT_decl_file   : 4
    <fe3>   DW_AT_decl_line   : 231
    <fe4>   DW_AT_decl_column : 12
    <fe5>   DW_AT_type        : <0xce0>
    <fe9>   DW_AT_data_member_location: 88
 <2><fea>: Abbrev Number: 11 (DW_TAG_member)
    <feb>   DW_AT_name        : (indirect string, offset: 0x3e6): _mbstate
    <fef>   DW_AT_decl_file   : 4
    <ff0>   DW_AT_decl_line   : 233
    <ff1>   DW_AT_decl_column : 14
    <ff2>   DW_AT_type        : <0xcba>
    <ff6>   DW_AT_data_member_location: 92
 <2><ff7>: Abbrev Number: 11 (DW_TAG_member)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x323): _flags2
    <ffc>   DW_AT_decl_file   : 4
    <ffd>   DW_AT_decl_line   : 234
    <ffe>   DW_AT_decl_column : 9
    <fff>   DW_AT_type        : <0xbf2>
    <1003>   DW_AT_data_member_location: 100
 <2><1004>: Abbrev Number: 0
 <1><1005>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <1006>   DW_AT_prototyped  : 1
    <1006>   DW_AT_type        : <0xbf2>
    <100a>   DW_AT_sibling     : <0x1023>
 <2><100e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <100f>   DW_AT_type        : <0x1023>
 <2><1013>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1014>   DW_AT_type        : <0xcc6>
 <2><1018>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1019>   DW_AT_type        : <0x1177>
 <2><101d>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <101e>   DW_AT_type        : <0xbf2>
 <2><1022>: Abbrev Number: 0
 <1><1023>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1024>   DW_AT_byte_size   : 4
    <1025>   DW_AT_type        : <0x102e>
 <1><1029>: Abbrev Number: 21 (DW_TAG_const_type)
    <102a>   DW_AT_type        : <0x1023>
 <1><102e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <102f>   DW_AT_name        : (indirect string, offset: 0x864): _reent
    <1033>   DW_AT_byte_size   : 1060
    <1035>   DW_AT_decl_file   : 4
    <1036>   DW_AT_decl_line   : 613
    <1038>   DW_AT_decl_column : 8
    <1039>   DW_AT_sibling     : <0x1177>
 <2><103d>: Abbrev Number: 23 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x1353): _errno
    <1042>   DW_AT_decl_file   : 4
    <1043>   DW_AT_decl_line   : 615
    <1045>   DW_AT_decl_column : 7
    <1046>   DW_AT_type        : <0xbf2>
    <104a>   DW_AT_data_member_location: 0
 <2><104b>: Abbrev Number: 23 (DW_TAG_member)
    <104c>   DW_AT_name        : (indirect string, offset: 0x1dd): _stdin
    <1050>   DW_AT_decl_file   : 4
    <1051>   DW_AT_decl_line   : 620
    <1053>   DW_AT_decl_column : 11
    <1054>   DW_AT_type        : <0x1263>
    <1058>   DW_AT_data_member_location: 4
 <2><1059>: Abbrev Number: 23 (DW_TAG_member)
    <105a>   DW_AT_name        : (indirect string, offset: 0x26a): _stdout
    <105e>   DW_AT_decl_file   : 4
    <105f>   DW_AT_decl_line   : 620
    <1061>   DW_AT_decl_column : 20
    <1062>   DW_AT_type        : <0x1263>
    <1066>   DW_AT_data_member_location: 8
 <2><1067>: Abbrev Number: 23 (DW_TAG_member)
    <1068>   DW_AT_name        : (indirect string, offset: 0x22f): _stderr
    <106c>   DW_AT_decl_file   : 4
    <106d>   DW_AT_decl_line   : 620
    <106f>   DW_AT_decl_column : 30
    <1070>   DW_AT_type        : <0x1263>
    <1074>   DW_AT_data_member_location: 12
 <2><1075>: Abbrev Number: 23 (DW_TAG_member)
    <1076>   DW_AT_name        : (indirect string, offset: 0x407): _inc
    <107a>   DW_AT_decl_file   : 4
    <107b>   DW_AT_decl_line   : 622
    <107d>   DW_AT_decl_column : 8
    <107e>   DW_AT_type        : <0xbf2>
    <1082>   DW_AT_data_member_location: 16
 <2><1083>: Abbrev Number: 23 (DW_TAG_member)
    <1084>   DW_AT_name        : (indirect string, offset: 0xfd): _emergency
    <1088>   DW_AT_decl_file   : 4
    <1089>   DW_AT_decl_line   : 623
    <108b>   DW_AT_decl_column : 8
    <108c>   DW_AT_type        : <0x1463>
    <1090>   DW_AT_data_member_location: 20
 <2><1091>: Abbrev Number: 23 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0x423): _unspecified_locale_info
    <1096>   DW_AT_decl_file   : 4
    <1097>   DW_AT_decl_line   : 626
    <1099>   DW_AT_decl_column : 7
    <109a>   DW_AT_type        : <0xbf2>
    <109e>   DW_AT_data_member_location: 48
 <2><109f>: Abbrev Number: 23 (DW_TAG_member)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x411): _locale
    <10a4>   DW_AT_decl_file   : 4
    <10a5>   DW_AT_decl_line   : 627
    <10a7>   DW_AT_decl_column : 22
    <10a8>   DW_AT_type        : <0x1478>
    <10ac>   DW_AT_data_member_location: 52
 <2><10ad>: Abbrev Number: 23 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x36a): __sdidinit
    <10b2>   DW_AT_decl_file   : 4
    <10b3>   DW_AT_decl_line   : 629
    <10b5>   DW_AT_decl_column : 7
    <10b6>   DW_AT_type        : <0xbf2>
    <10ba>   DW_AT_data_member_location: 56
 <2><10bb>: Abbrev Number: 23 (DW_TAG_member)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x419): __cleanup
    <10c0>   DW_AT_decl_file   : 4
    <10c1>   DW_AT_decl_line   : 631
    <10c3>   DW_AT_decl_column : 10
    <10c4>   DW_AT_type        : <0x1489>
    <10c8>   DW_AT_data_member_location: 60
 <2><10c9>: Abbrev Number: 23 (DW_TAG_member)
    <10ca>   DW_AT_name        : (indirect string, offset: 0x2a3): _result
    <10ce>   DW_AT_decl_file   : 4
    <10cf>   DW_AT_decl_line   : 634
    <10d1>   DW_AT_decl_column : 19
    <10d2>   DW_AT_type        : <0xd46>
    <10d6>   DW_AT_data_member_location: 64
 <2><10d7>: Abbrev Number: 23 (DW_TAG_member)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x254): _result_k
    <10dc>   DW_AT_decl_file   : 4
    <10dd>   DW_AT_decl_line   : 635
    <10df>   DW_AT_decl_column : 7
    <10e0>   DW_AT_type        : <0xbf2>
    <10e4>   DW_AT_data_member_location: 68
 <2><10e5>: Abbrev Number: 23 (DW_TAG_member)
    <10e6>   DW_AT_name        : (indirect string, offset: 0x545): _p5s
    <10ea>   DW_AT_decl_file   : 4
    <10eb>   DW_AT_decl_line   : 636
    <10ed>   DW_AT_decl_column : 19
    <10ee>   DW_AT_type        : <0xd46>
    <10f2>   DW_AT_data_member_location: 72
 <2><10f3>: Abbrev Number: 23 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x375): _freelist
    <10f8>   DW_AT_decl_file   : 4
    <10f9>   DW_AT_decl_line   : 637
    <10fb>   DW_AT_decl_column : 20
    <10fc>   DW_AT_type        : <0x148f>
    <1100>   DW_AT_data_member_location: 76
 <2><1101>: Abbrev Number: 23 (DW_TAG_member)
    <1102>   DW_AT_name        : (indirect string, offset: 0x272): _cvtlen
    <1106>   DW_AT_decl_file   : 4
    <1107>   DW_AT_decl_line   : 640
    <1109>   DW_AT_decl_column : 7
    <110a>   DW_AT_type        : <0xbf2>
    <110e>   DW_AT_data_member_location: 80
 <2><110f>: Abbrev Number: 23 (DW_TAG_member)
    <1110>   DW_AT_name        : (indirect string, offset: 0x1e4): _cvtbuf
    <1114>   DW_AT_decl_file   : 4
    <1115>   DW_AT_decl_line   : 641
    <1117>   DW_AT_decl_column : 9
    <1118>   DW_AT_type        : <0x1177>
    <111c>   DW_AT_data_member_location: 84
 <2><111d>: Abbrev Number: 23 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0x3a7): _new
    <1122>   DW_AT_decl_file   : 4
    <1123>   DW_AT_decl_line   : 676
    <1125>   DW_AT_decl_column : 7
    <1126>   DW_AT_type        : <0x143e>
    <112a>   DW_AT_data_member_location: 88
 <2><112b>: Abbrev Number: 24 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x362): _atexit
    <1130>   DW_AT_decl_file   : 4
    <1131>   DW_AT_decl_line   : 680
    <1133>   DW_AT_decl_column : 19
    <1134>   DW_AT_type        : <0xe77>
    <1138>   DW_AT_data_member_location: 328
 <2><113a>: Abbrev Number: 24 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x281): _atexit0
    <113f>   DW_AT_decl_file   : 4
    <1140>   DW_AT_decl_line   : 681
    <1142>   DW_AT_decl_column : 18
    <1143>   DW_AT_type        : <0xe34>
    <1147>   DW_AT_data_member_location: 332
 <2><1149>: Abbrev Number: 24 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0x4f9): _sig_func
    <114e>   DW_AT_decl_file   : 4
    <114f>   DW_AT_decl_line   : 685
    <1151>   DW_AT_decl_column : 12
    <1152>   DW_AT_type        : <0x14a0>
    <1156>   DW_AT_data_member_location: 732
 <2><1158>: Abbrev Number: 24 (DW_TAG_member)
    <1159>   DW_AT_name        : (indirect string, offset: 0x1c6): __sglue
    <115d>   DW_AT_decl_file   : 4
    <115e>   DW_AT_decl_line   : 690
    <1160>   DW_AT_decl_column : 16
    <1161>   DW_AT_type        : <0x1224>
    <1165>   DW_AT_data_member_location: 736
 <2><1167>: Abbrev Number: 24 (DW_TAG_member)
    <1168>   DW_AT_name        : (indirect string, offset: 0x1a1): __sf
    <116c>   DW_AT_decl_file   : 4
    <116d>   DW_AT_decl_line   : 692
    <116f>   DW_AT_decl_column : 10
    <1170>   DW_AT_type        : <0x14ac>
    <1174>   DW_AT_data_member_location: 748
 <2><1176>: Abbrev Number: 0
 <1><1177>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1178>   DW_AT_byte_size   : 4
    <1179>   DW_AT_type        : <0x117d>
 <1><117d>: Abbrev Number: 3 (DW_TAG_base_type)
    <117e>   DW_AT_byte_size   : 1
    <117f>   DW_AT_encoding    : 6	(signed char)
    <1180>   DW_AT_name        : (indirect string, offset: 0x98): char
 <1><1184>: Abbrev Number: 21 (DW_TAG_const_type)
    <1185>   DW_AT_type        : <0x117d>
 <1><1189>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <118a>   DW_AT_byte_size   : 4
    <118b>   DW_AT_type        : <0x1005>
 <1><118f>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <1190>   DW_AT_prototyped  : 1
    <1190>   DW_AT_type        : <0xbf2>
    <1194>   DW_AT_sibling     : <0x11ad>
 <2><1198>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1199>   DW_AT_type        : <0x1023>
 <2><119d>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <119e>   DW_AT_type        : <0xcc6>
 <2><11a2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11a3>   DW_AT_type        : <0x11ad>
 <2><11a7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11a8>   DW_AT_type        : <0xbf2>
 <2><11ac>: Abbrev Number: 0
 <1><11ad>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <11ae>   DW_AT_byte_size   : 4
    <11af>   DW_AT_type        : <0x1184>
 <1><11b3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <11b4>   DW_AT_byte_size   : 4
    <11b5>   DW_AT_type        : <0x118f>
 <1><11b9>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <11ba>   DW_AT_prototyped  : 1
    <11ba>   DW_AT_type        : <0xc58>
    <11be>   DW_AT_sibling     : <0x11d7>
 <2><11c2>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11c3>   DW_AT_type        : <0x1023>
 <2><11c7>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11c8>   DW_AT_type        : <0xcc6>
 <2><11cc>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11cd>   DW_AT_type        : <0xc58>
 <2><11d1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11d2>   DW_AT_type        : <0xbf2>
 <2><11d6>: Abbrev Number: 0
 <1><11d7>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <11d8>   DW_AT_byte_size   : 4
    <11d9>   DW_AT_type        : <0x11b9>
 <1><11dd>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <11de>   DW_AT_prototyped  : 1
